SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_timer.c
/*!
    \file    gd32e23x_hal_timer.c
    \brief   TIMER driver
    
    \version 2019-03-14, V1.0.0, firmware for GD32E10x
*/

/*
    Copyright (c) 2019, GigaDevice Semiconductor Inc.

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32e23x_hal.h"

#define UINT16_T_MAX 65535
#define UINT8_T_MAX 255

/* DMA callback function */
/* DMA transmission complete(TC) callback for TIMER update dma request */
static void _update_dmatc_callback(void *dma);
/* DMA error callback for TIMER all dma request */
static void _timer_dmaerror_callback(void *dma);
/* DMA transmission complete(TC) callback for TIMER channel input capture dma request */
static void _channel_capture_dmatc_callback(void *dma);
/* DMA transmission complete(TC) callback for TIMER compare and pwm dma request */
static void _channel_compare_pwm_dmatc_callback(void *dma);
/* DMA transmission complete(TC) callback for TIMER commutation dma request */
static void _commutation_dmatc_callback(void *dma);
/* DMA transmission complete(TC) callback for TIMER trigger dma request */
static void _trigger_dmatc_callback(void *dma);

/* disable TIMER */
static int32_t _timer_disable(hal_timer_dev_struct *timer_dev);
/* enable or disable TIMER primary output */
static void _timer_primary_output_config(hal_timer_dev_struct *timer_dev , ControlStatus state);

/*!
    \brief      initialize the TIMER structure with the default values
    \param[in]  hal_struct_type: refer to hal_timer_struct_type_enum
    \param[in]  p_struct: point to TIMER structure that contains the configuration information
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_struct_init(hal_timer_struct_type_enum struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == p_struct){
        HAL_DEBUGE("parameter [*p_struct] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    switch(struct_type){
        case HAL_TIMER_BASIC_STRUCT:
            /* initialize TIMER basic config struct with the default values */
            ((hal_timer_basic_struct*)p_struct)->prescaler         = 0U;
            ((hal_timer_basic_struct*)p_struct)->alignedmode       = TIMER_COUNTER_EDGE;
            ((hal_timer_basic_struct*)p_struct)->counterdirection  = TIMER_COUNTER_UP;
            ((hal_timer_basic_struct*)p_struct)->period            = 65535U;
            ((hal_timer_basic_struct*)p_struct)->clockdivision     = TIMER_CKDIV_DIV1;
            ((hal_timer_basic_struct*)p_struct)->repetitioncounter = 0U;
            ((hal_timer_basic_struct*)p_struct)->autoreload_shadow = AUTO_RELOAD_SHADOW_DISABLE;
            ((hal_timer_basic_struct*)p_struct)->trgo_selection = TIMRE_TRGO_SRC_RESET;
            ((hal_timer_basic_struct*)p_struct)->master_slave_mode = TIMER_MASTER_SLAVE_MODE_DISABLE;
            break;
        case HAL_TIMER_CLOCKSOURCE_STRUCT:
            /* initialize TIMER clock source struct with the default values */
            ((hal_timer_clocksource_struct*)p_struct)->clock_source         = TIMER_CLOCK_SOURCE_CK_TIMER;
            ((hal_timer_clocksource_struct*)p_struct)->clock_polarity       = TIMER_CLOCK_TRIGGER_POLARITY_ETI_RISING;
            ((hal_timer_clocksource_struct*)p_struct)->clock_prescaler  = TIMER_CLOCK_PRESCALER_DIV1;
            ((hal_timer_clocksource_struct*)p_struct)->clock_filter            = 0U;
            break;
        case HAL_TIMER_SLAVEMODE_STRUCT:
            /* initialize TIMER slave mode struct with the default values */
            ((hal_timer_slavemode_struct*)p_struct)->slavemode         = TIMER_SLAVE_DISABLE_MODE;
            ((hal_timer_slavemode_struct*)p_struct)->trigger_selection       = TIMER_TRIGGER_SOURCE_ITI0;
            ((hal_timer_slavemode_struct*)p_struct)->trigger_polarity  = TIMER_CLOCK_TRIGGER_POLARITY_RISING;
            ((hal_timer_slavemode_struct*)p_struct)->trigger_prescaler            = TIMER_EXT_TRI_PSC_OFF;
            ((hal_timer_slavemode_struct*)p_struct)->trigger_filter            = 0U;
            break;
        case HAL_TIMER_INPUTCAPTURE_STRUCT:
            /* initialize TIMER input capture struct with the default values */
            ((hal_timer_inputcapture_struct*)p_struct)->icfilter         = 0U;
            ((hal_timer_inputcapture_struct*)p_struct)->icpolarity      = TIMER_IC_POLARITY_RISING;
            ((hal_timer_inputcapture_struct*)p_struct)->icprescaler  = TIMER_IC_PSC_DIV1;
            ((hal_timer_inputcapture_struct*)p_struct)->icselection            = TIMER_IC_SELECTION_DIRECTTI;
            break;
        case HAL_TIMER_QUADRATURE_DECODER_STRUCT:
            /* initialize TIMER quadrature decoder struct with the default values */
            ((hal_timer_quadrature_decoder_struct*)p_struct)->decodemode = TIMER_QUADRATURE_DECODER_MODE0;
            ((hal_timer_quadrature_decoder_struct*)p_struct)->ci0_filter = 0;
            ((hal_timer_quadrature_decoder_struct*)p_struct)->ci0_polarity = TIMER_IC_POLARITY_RISING;
            ((hal_timer_quadrature_decoder_struct*)p_struct)->ci0_prescaler = TIMER_IC_PSC_DIV1;
            ((hal_timer_quadrature_decoder_struct*)p_struct)->ci0_selection = TIMER_IC_SELECTION_DIRECTTI;
            ((hal_timer_quadrature_decoder_struct*)p_struct)->ci1_filter = 0;
            ((hal_timer_quadrature_decoder_struct*)p_struct)->ci1_polarity = TIMER_IC_POLARITY_RISING;
            ((hal_timer_quadrature_decoder_struct*)p_struct)->ci1_prescaler = TIMER_IC_PSC_DIV1;
            ((hal_timer_quadrature_decoder_struct*)p_struct)->ci1_selection = TIMER_IC_SELECTION_DIRECTTI;
            break;
        case HAL_TIMER_SINGLEPULSE_STRUCT:
            /* initialize TIMER single pulse struct with the default values */
            ((hal_timer_singlepulse_struct*)p_struct)->sp_ci_filter = 0;
            ((hal_timer_singlepulse_struct*)p_struct)->sp_ci_polarity = TIMER_IC_POLARITY_RISING;
            ((hal_timer_singlepulse_struct*)p_struct)->sp_ci_selection = TIMER_IC_SELECTION_DIRECTTI;
            ((hal_timer_singlepulse_struct*)p_struct)->sp_ocidlestate = TIMER_OC_IDLE_STATE_LOW;
            ((hal_timer_singlepulse_struct*)p_struct)->sp_ocmode = TIMER_OUTPUT_TIMING_MODE;
            ((hal_timer_singlepulse_struct*)p_struct)->sp_ocnidlestate = TIMER_OCN_IDLE_STATE_LOW;
            ((hal_timer_singlepulse_struct*)p_struct)->sp_ocnpolarity = TIMER_OCN_POLARITY_HIGH;
            ((hal_timer_singlepulse_struct*)p_struct)->sp_ocpolarity = TIMER_OC_POLARITY_HIGH;
            ((hal_timer_singlepulse_struct*)p_struct)->sp_pulse = 0;
            break;
        case HAL_TIMER_OUTPUTCOMPARE_STRUCT:
            /* initialize TIMER output compare struct with the default values */
            ((hal_timer_outputcompare_struct*)p_struct)->output_fastmode = TIMER_OC_FAST_DISABLE;
            ((hal_timer_outputcompare_struct*)p_struct)->output_idlestate = TIMER_OC_IDLE_STATE_LOW;
            ((hal_timer_outputcompare_struct*)p_struct)->output_mode = TIMER_OUTPUT_TIMING_MODE;
            ((hal_timer_outputcompare_struct*)p_struct)->outputn_idlestate = TIMER_OCN_IDLE_STATE_LOW;
            ((hal_timer_outputcompare_struct*)p_struct)->outputn_polarity =TIMER_OCN_POLARITY_HIGH ;
            ((hal_timer_outputcompare_struct*)p_struct)->output_polarity = TIMER_OC_POLARITY_HIGH;
            ((hal_timer_outputcompare_struct*)p_struct)->output_pulse = 0;
            break;
        case HAL_TIMER_OCPRE_CLEAR_STRUCT:
            /* initialize TIMER OxCPRE clear struct with the default values */
            ((hal_timer_ocpre_clear_struct*)p_struct)->ocpre_clear_source = TIMER_OCPRE_CLEAR_SOURCE_DISABLE;
            ((hal_timer_ocpre_clear_struct*)p_struct)->ocpre_clear_state = DISABLE;
            ((hal_timer_ocpre_clear_struct*)p_struct)->trigger_filter = 0;
            ((hal_timer_ocpre_clear_struct*)p_struct)->trigger_polarity = TIMER_ETP_RISING;
            ((hal_timer_ocpre_clear_struct*)p_struct)->trigger_prescaler = TIMER_EXT_TRI_PSC_OFF;
            break;
        case HAL_TIMER_HALL_STRUCT:
            /* initialize TIMER HALL struct with the default values */
            ((hal_timer_hall_struct*)p_struct)->cmt_delay = 0;
            ((hal_timer_hall_struct*)p_struct)->hall_filter = 0;
            ((hal_timer_hall_struct*)p_struct)->hall_polarity = TIMER_IC_POLARITY_RISING;
            ((hal_timer_hall_struct*)p_struct)->hall_prescaler = TIMER_IC_PSC_DIV1;
            break;
        case HAL_TIMER_BREAKCONFIG_STRUCT:
            /* initialize TIMER break config struct with the default values */
            ((hal_timer_breakconfig_struct*)p_struct)->breakpolarity = TIMER_BREAK_POLARITY_LOW;
            ((hal_timer_breakconfig_struct*)p_struct)->breakstate = TIMER_BREAK_DISABLE;
            ((hal_timer_breakconfig_struct*)p_struct)->deadtime = 0;
            ((hal_timer_breakconfig_struct*)p_struct)->ideloffstate = TIMER_IOS_STATE_DISABLE;
            ((hal_timer_breakconfig_struct*)p_struct)->outputautostate = TIMER_OUTAUTO_DISABLE;
            ((hal_timer_breakconfig_struct*)p_struct)->protectmode = TIMER_CCHP_PROT_OFF;
            ((hal_timer_breakconfig_struct*)p_struct)->runoffstate = TIMER_ROS_STATE_DISABLE;
            break;
        case HAL_TIMER_IRQ_STRUCT:
            ((hal_timer_irq_struct*)p_struct)->break_usercb = NULL;
            ((hal_timer_irq_struct*)p_struct)->channelx_capture_usercb = NULL;
            ((hal_timer_irq_struct*)p_struct)->channelx_compare_usercb = NULL;
            ((hal_timer_irq_struct*)p_struct)->channelx_pwm_usercb = NULL;
            ((hal_timer_irq_struct*)p_struct)->commutation_usercb = NULL;
            ((hal_timer_irq_struct*)p_struct)->dmaerror_usercb = NULL;
            ((hal_timer_irq_struct*)p_struct)->dmatc_chx_capture_usercb = NULL;
            ((hal_timer_irq_struct*)p_struct)->dmatc_chx_cmppwm_usercb = NULL;
            ((hal_timer_irq_struct*)p_struct)->dmatc_commutation_usercb = NULL;
            ((hal_timer_irq_struct*)p_struct)->dmatc_trigger_usercb = NULL;
            ((hal_timer_irq_struct*)p_struct)->dmatc_update_usercb = NULL;
            ((hal_timer_irq_struct*)p_struct)->trigger_usercb = NULL;
            ((hal_timer_irq_struct*)p_struct)->update_usercb = NULL;
            break; 
        case HAL_TIMER_DEV_STRUCT:
            /* initialize TIMER device information struct with the default values */
            ((hal_timer_dev_struct*)p_struct)->hdma[0] = NULL;
            ((hal_timer_dev_struct*)p_struct)->hdma[1] = NULL;
            ((hal_timer_dev_struct*)p_struct)->hdma[2] = NULL;
            ((hal_timer_dev_struct*)p_struct)->hdma[3] = NULL;
            ((hal_timer_dev_struct*)p_struct)->hdma[4] = NULL;
            ((hal_timer_dev_struct*)p_struct)->hdma[5] = NULL;
            ((hal_timer_dev_struct*)p_struct)->hdma[6] = NULL;
            ((hal_timer_dev_struct*)p_struct)->periph = 0;
            ((hal_timer_dev_struct*)p_struct)->service_channel = TIMER_SERVICE_CHANNEL_NONE;
            ((hal_timer_dev_struct*)p_struct)->timer_irq.break_usercb = NULL;
            ((hal_timer_dev_struct*)p_struct)->timer_irq.channelx_capture_usercb = NULL;
            ((hal_timer_dev_struct*)p_struct)->timer_irq.channelx_compare_usercb = NULL;
            ((hal_timer_dev_struct*)p_struct)->timer_irq.channelx_pwm_usercb = NULL;
            ((hal_timer_dev_struct*)p_struct)->timer_irq.commutation_usercb = NULL;
            ((hal_timer_dev_struct*)p_struct)->timer_irq.trigger_usercb = NULL;
            ((hal_timer_dev_struct*)p_struct)->timer_irq.update_usercb = NULL;
            ((hal_timer_dev_struct*)p_struct)->timer_irq.dmaerror_usercb = NULL;
            ((hal_timer_dev_struct*)p_struct)->timer_irq.dmatc_chx_capture_usercb = NULL;
            ((hal_timer_dev_struct*)p_struct)->timer_irq.dmatc_chx_cmppwm_usercb = NULL;
            ((hal_timer_dev_struct*)p_struct)->timer_irq.dmatc_commutation_usercb = NULL;
            ((hal_timer_dev_struct*)p_struct)->timer_irq.dmatc_trigger_usercb = NULL;
            ((hal_timer_dev_struct*)p_struct)->timer_irq.dmatc_update_usercb = NULL;
            break;
        default:
            HAL_DEBUGW("parameter [struct_type] value is undefine");
            break;
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      deinitialize TIMER
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_deinit(hal_timer_dev_struct *timer_dev)
{
    uint32_t periph;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

