SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_timer.c
    periph = timer_dev->periph;
    /* deinit a TIMER */
    timer_deinit(timer_dev->periph);
    /* initialize the TIMER structure with the default values */
    hal_timer_struct_init(HAL_TIMER_DEV_STRUCT,timer_dev);
    timer_dev->periph = periph;
    return HAL_ERR_NONE;
}

/*!
    \brief      initialize TIMER timebase
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timer_periph: specify which TIMER timebase is initialized 
      \arg        TIMERx(x=0,2,5,13..16)
    \param[in]  timer_basic: TIMER basic structure pointer
                  prescaler: prescaler value of the counter clock,0~65535
                  alignedmode: TIMER_COUNTER_EDGE, TIMER_COUNTER_CENTER_DOWN, TIMER_COUNTER_CENTER_UP, TIMER_COUNTER_CENTER_BOTH
                  counterdirection: TIMER_COUNTER_UP, TIMER_COUNTER_DOWN
                  period: counter auto reload value,0~65535
                  clockdivision: TIMER_CKDIV_DIV1, TIMER_CKDIV_DIV2, TIMER_CKDIV_DIV4
                  repetitioncounter: counter repetition value,0~255
                  autoreload_shadow:AUTO_RELOAD_SHADOW_ENABLE, AUTO_RELOAD_SHADOW_DISABLE
                  trgo_selection:
                    the argument could be selected from enumeration <hal_timer_trgo_selection_enum>
                  master_slave_mode:TIMER_MASTER_SLAVE_MODE_ENABLE, TIMER_MASTER_SLAVE_MODE_DISABLE
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_basic_init(hal_timer_dev_struct *timer_dev, uint32_t timer_periph, hal_timer_basic_struct *timer_basic)
{
    timer_parameter_struct timerbase;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    /* check the parameters */
    if(NULL == timer_basic){
        HAL_DEBUGE("pointer [timer_basic] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    /* check the parameters */
    if((TIMER0 != timer_periph) && (TIMER2 != timer_periph) && (TIMER5 != timer_periph)\
        && (TIMER13 != timer_periph) && (TIMER14 != timer_periph) && (TIMER15 != timer_periph)\
        &&(TIMER16 != timer_periph))
    {
        HAL_DEBUGE("pointer [timer_periph] address is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* struct assignment */
    timer_dev->periph = timer_periph;
    timerbase.alignedmode = timer_basic->alignedmode;
    timerbase.clockdivision = timer_basic->clockdivision;
    timerbase.counterdirection = timer_basic->counterdirection;
    timerbase.period = timer_basic->period;
    timerbase.prescaler = timer_basic->prescaler;
    timerbase.repetitioncounter = timer_basic->repetitioncounter;
    /* initialize TIMER basic settings */
    timer_init(timer_dev->periph,(&timerbase));
    /* setting the shadow register for TIMERx_CAR register */
    TIMER_CTL0(timer_dev->periph) &= TIMER_CTL0_ARSE;
    TIMER_CTL0(timer_dev->periph) |= timer_basic->autoreload_shadow;
    /* configure TIMER master slave mode */
    timer_master_slave_mode_config(timer_dev->periph, timer_basic->master_slave_mode);
    /* select TIMER master mode output trigger source */
    timer_master_output_trigger_source_select(timer_dev->periph, timer_basic->trgo_selection);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      TIMER counter enable
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_start_counter(hal_timer_dev_struct *timer_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* enable a TIMER */
    timer_enable(timer_dev->periph);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      TIMER counter disable
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_stop_counter(hal_timer_dev_struct *timer_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* disable a TIMER */
    timer_disable(timer_dev->periph);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      TIMER counter and update interrupt enable
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_start_counter_interrupt(hal_timer_dev_struct *timer_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* enable the TIMER interrupt */
    timer_interrupt_enable(timer_dev->periph, TIMER_INT_UP);
    /* enable a TIMER */
    timer_enable(timer_dev->periph);
    return HAL_ERR_NONE;
}

/*!
    \brief      TIMER counter and update interrupt stop
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_stop_counter_interrupt(hal_timer_dev_struct *timer_dev)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* disable the TIMER interrupt */
    timer_interrupt_disable(timer_dev->periph, TIMER_INT_UP);
    /* disable a TIMER */
    ret_val = _timer_disable(timer_dev);
    return ret_val;
}

/*!
    \brief      TIMER counter and update DMA request enable 
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  buffer: the source memory buffer address
    \param[in]  blength: the number of data to be transferred from source to destination,0~65535
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_start_counter_dma(hal_timer_dev_struct *timer_dev, uint32_t *buffer, uint16_t blength)
{
    hal_dma_irq_struct dma_irq;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    /* check the parameters */
    if(NULL == buffer){
        HAL_DEBUGE("pointer [buffer] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    
