SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_timer.c
    /* DMA channel full transfer finish interrupt handler pointer */
    dma_irq.full_finish_handle = _update_dmatc_callback;
    /* DMA channel error interrupt handler pointer */
    dma_irq.error_handle = _timer_dmaerror_callback;
    /* DMA channel half transfer finish interrupt handler pointer */
    dma_irq.half_finish_handle = NULL;
    /* start DMA interrupt mode transfer */
    hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_UP], (uint32_t)buffer, TIMER_CAR_ADDRESS(timer_dev->periph), blength, &dma_irq);
    /* enable the TIMER DMA update request */
    timer_dma_enable(timer_dev->periph, TIMER_DMA_UPD);
    /* enable a TIMER */
    timer_enable(timer_dev->periph);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      TIMER counter and update DMA request disable 
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_stop_counter_dma(hal_timer_dev_struct *timer_dev)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    
    /* disable the TIMER DMA update request */
    timer_dma_disable(timer_dev->periph, TIMER_DMA_UPD);
    /* stop DMA transfer */
    hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_UP]);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    
    return ret_val;
}

/*!
    \brief      TIMER slave mode config 
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timer_slavemode: TIMER slave mode config struct
                  slavemode:
                    the argument could be selected from enumeration <hal_timer_slave_mode_enum>
                  trigger_selection:
                    the argument could be selected from enumeration <hal_timer_input_trigger_source_enum> 
                  trigger_polarity:
                    the argument could be selected from enumeration <hal_timer_clock_trigger_polarity_enum> 
                  trigger_prescaler:
                    only one parameter can be selected which is shown as below:
      \arg          TIMER_EXT_TRI_PSC_OFF: no divided
      \arg          TIMER_EXT_TRI_PSC_DIV2: divided by 2
      \arg          TIMER_EXT_TRI_PSC_DIV4: divided by 4
      \arg          TIMER_EXT_TRI_PSC_DIV8: divided by 8
                  trigger_filter: 0x0~0xF
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_slave_mode_config(hal_timer_dev_struct *timer_dev, hal_timer_slavemode_struct *timer_slavemode)
{
    uint32_t chctl2;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    /* check the parameters */
    if(NULL == timer_slavemode){
        HAL_DEBUGE("pointer [timer_slavemode] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    
    /* select TIMER input trigger source  */
    timer_input_trigger_source_select(timer_dev->periph, timer_slavemode->trigger_selection);
    /* select TIMER slave mode */
    timer_slave_mode_select(timer_dev->periph, timer_slavemode->slavemode);
    switch(timer_slavemode->trigger_selection){
        case TIMER_TRIGGER_SOURCE_ITI0:
            /* no need to config polarity, prescaler, filter */
            break;
        case TIMER_TRIGGER_SOURCE_ITI1:
            /* no need to config polarity, prescaler, filter */
            break;
        case TIMER_TRIGGER_SOURCE_ITI2:
            /* no need to config polarity, prescaler, filter */
            break;
        case TIMER_TRIGGER_SOURCE_ITI3:
            /* no need to config polarity, prescaler, filter */
            break;
        case TIMER_TRIGGER_SOURCE_CI0FE0:
            chctl2 = TIMER_CHCTL2(timer_dev->periph);
            /* reset the CH0EN bit */
            TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
            /* reset the CH0P and CH0NP bits */
            TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_CH0NP));
            /* config polarity */
            TIMER_CHCTL2(timer_dev->periph) |= (uint32_t)(timer_slavemode->trigger_polarity);
            /* reset the CH0CAPFLT bit */
            TIMER_CHCTL0(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
            /* config filter */
            TIMER_CHCTL0(timer_dev->periph) |= (uint32_t)((uint32_t)(timer_slavemode->trigger_filter) << 4U);
            TIMER_CHCTL2(timer_dev->periph) = chctl2;
            break;
        case TIMER_TRIGGER_SOURCE_CI1FE1:
            chctl2 = TIMER_CHCTL2(timer_dev->periph);
            /* reset the CH1EN bit */
            TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);
            /* reset the CH1P and CH1NP bits */
            TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_CH1NP));
            /* config polarity */
            TIMER_CHCTL2(timer_dev->periph) |= (uint32_t)((uint32_t)(timer_slavemode->trigger_polarity) << 4U);
            /* reset the CH1CAPFLT bit */
            TIMER_CHCTL0(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL0_CH1CAPFLT);
            /* config filter */
            TIMER_CHCTL0(timer_dev->periph) |= (uint32_t)((uint32_t)(timer_slavemode->trigger_filter) << 12U);
            TIMER_CHCTL2(timer_dev->periph) = chctl2;
            break;
        case TIMER_TRIGGER_SOURCE_CI0FED:
            chctl2 = TIMER_CHCTL2(timer_dev->periph);
            /* reset the CH0EN bit */
            TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
            /* reset the CH0CAPFLT bit */
            TIMER_CHCTL0(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
            /* config filter */
            TIMER_CHCTL0(timer_dev->periph) |= (uint32_t)((uint32_t)(timer_slavemode->trigger_filter) << 4U);
            TIMER_CHCTL2(timer_dev->periph) = chctl2;
            break;
        case TIMER_TRIGGER_SOURCE_ETIFP:
            /* external clock mode 1 disabled */
            TIMER_SMCFG(timer_dev->periph) &= ~(uint32_t)TIMER_SMCFG_SMC1;
            /* configure TIMER external trigger input */
            timer_external_trigger_config(timer_dev->periph, timer_slavemode->trigger_prescaler, 
            timer_slavemode->trigger_polarity, timer_slavemode->trigger_filter);
            break;
        default:
            HAL_DEBUGW("parameter [timer_slavemode->trigger_selection] value is undefine");
            break;
    }
    /* disable the TIMER interrupt */
    timer_interrupt_disable(timer_dev->periph, TIMER_INT_TRG);
    /* disable the TIMER DMA trigger request */
    timer_dma_disable(timer_dev->periph, TIMER_DMA_TRGD);
    
