SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_timer.c
    switch(timer_clock->clock_source){
        case TIMER_CLOCK_SOURCE_CK_TIMER:
            /* configure TIMER internal clock mode */
            timer_internal_clock_config(timer_dev->periph);
            break;
        case TIMER_CLOCK_SOURCE_ITI0:
            /* configure TIMER the internal trigger as external clock input */
            timer_internal_trigger_as_external_clock_config(timer_dev->periph,TIMER_SMCFG_TRGSEL_ITI0);
            break;
        case TIMER_CLOCK_SOURCE_ITI1:
            /* configure TIMER the internal trigger as external clock input */
            timer_internal_trigger_as_external_clock_config(timer_dev->periph,TIMER_SMCFG_TRGSEL_ITI1);
            break;
        case TIMER_CLOCK_SOURCE_ITI2:
            /* configure TIMER the internal trigger as external clock input */
            timer_internal_trigger_as_external_clock_config(timer_dev->periph,TIMER_SMCFG_TRGSEL_ITI2);
            break;
        case TIMER_CLOCK_SOURCE_ITI3:
            /* configure TIMER the internal trigger as external clock input */
            timer_internal_trigger_as_external_clock_config(timer_dev->periph,TIMER_SMCFG_TRGSEL_ITI3);
            break;
        case TIMER_CLOCK_SOURCE_CI0FE0:
            /* configure TIMER the external trigger as external clock input */
            timer_external_trigger_as_external_clock_config(timer_dev->periph,TIMER_SMCFG_TRGSEL_CI0FE0,
            timer_clock->clock_polarity,timer_clock->clock_filter);
            /* reset the CH0EN bit */
            TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
            break;
        case TIMER_CLOCK_SOURCE_CI1FE1:
            /* configure TIMER the external trigger as external clock input */
            timer_external_trigger_as_external_clock_config(timer_dev->periph,TIMER_SMCFG_TRGSEL_CI1FE1,
            timer_clock->clock_polarity,timer_clock->clock_filter);
            /* reset the CH1EN bit */
            TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);
            break;
        case TIMER_CLOCK_SOURCE_CI0FED:
            /* configure TIMER the external trigger as external clock input */
            timer_external_trigger_as_external_clock_config(timer_dev->periph,TIMER_SMCFG_TRGSEL_CI0F_ED,
            timer_clock->clock_polarity,timer_clock->clock_filter);
            /* reset the CH0EN bit */ 
            TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
            break;
        case TIMER_CLOCK_SOURCE_ETIMODE0:
            /* configure TIMER the external clock mode0 */
            timer_external_clock_mode0_config(timer_dev->periph,timer_clock ->clock_prescaler,
            timer_clock->clock_polarity,timer_clock->clock_filter);
            break;
        case TIMER_CLOCK_SOURCE_ETIMODE1:
            /* configure TIMER the external clock mode1 */
            timer_external_clock_mode1_config(timer_dev->periph,timer_clock ->clock_prescaler,
            timer_clock->clock_polarity,timer_clock->clock_filter);
            break;
        default:
            HAL_DEBUGW("parameter [timer_clock->clock_source] value is undefine");
            break;
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      TIMER break config 
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  break_cofig: TIMER break parameter struct
                    runoffstate: TIMER_ROS_STATE_ENABLE,TIMER_ROS_STATE_DISABLE
                    ideloffstate: TIMER_IOS_STATE_ENABLE,TIMER_IOS_STATE_DISABLE
                    deadtime: 0~255
                    breakpolarity: TIMER_BREAK_POLARITY_LOW,TIMER_BREAK_POLARITY_HIGH
                    outputautostate: TIMER_OUTAUTO_ENABLE,TIMER_OUTAUTO_DISABLE
                    protectmode: TIMER_CCHP_PROT_OFF,TIMER_CCHP_PROT_0,TIMER_CCHP_PROT_1,TIMER_CCHP_PROT_2
                    breakstate: TIMER_BREAK_ENABLE,TIMER_BREAK_DISABLE
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_break_config(hal_timer_dev_struct *timer_dev, hal_timer_breakconfig_struct *break_cofig)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    /* check the parameters */
    if(NULL == break_cofig){
        HAL_DEBUGE("pointer [break_cofig] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    
    /* configure TIMER break function */
    timer_break_config(timer_dev->periph, break_cofig);
    
    return HAL_ERR_NONE;
}



/*!
    \brief      TIMER OxCPRE signal clear config 
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  oc_clear: TIMER output compare clear struct
                  ocpre_clear_source: TIMER_OCPRE_CLEAR_SOURCE_DISABLE,TIMER_OCPRE_CLEAR_SOURCE_CLR,TIMER_OCPRE_CLEAR_SOURCE_ETIF
                  ocpre_clear_state: ENABLE or DISABLE 
                  trigger_polarity: TIMER_ETP_FALLING,TIMER_ETP_RISING 
                  trigger_prescaler: TIMER_EXT_TRI_PSC_OFF,TIMER_EXT_TRI_PSC_DIV2,TIMER_EXT_TRI_PSC_DIV4,TIMER_EXT_TRI_PSC_DIV8
                  trigger_filter:0~15
    \param[in]  channel: TIMER_CH_0,TIMER_CH_1,TIMER_CH_2,TIMER_CH_3
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL details refer to gd32e23x_hal.h
*/
int32_t hal_timer_ocpre_clear_config(hal_timer_dev_struct *timer_dev,hal_timer_ocpre_clear_struct *oc_clear, uint32_t channel)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    /* check the parameters */
    if(NULL == oc_clear){
        HAL_DEBUGE("pointer [oc_clear] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    /* check the parameters */
    if((TIMER_CH_0 != channel) && (TIMER_CH_1 != channel) && \
       (TIMER_CH_2 != channel) && (TIMER_CH_3 != channel) ){
        HAL_DEBUGE("parameter channel is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    switch(oc_clear->ocpre_clear_source){
        case TIMER_OCPRE_CLEAR_SOURCE_DISABLE:
            /* disable configure TIMER OCPRE clear source */
            TIMER_SMCFG(timer_dev->periph) &= ~(TIMER_SMCFG_OCRC | TIMER_SMCFG_ETFC | TIMER_SMCFG_ETPSC | TIMER_SMCFG_SMC1 | TIMER_SMCFG_ETP);
            break;
        case TIMER_OCPRE_CLEAR_SOURCE_CLR:
            /* configure TIMER OCPRE clear source selection */
            timer_ocpre_clear_source_config(timer_dev->periph, TIMER_OCPRE_CLEAR_SOURCE_CLR) ;
            break; 
        case TIMER_OCPRE_CLEAR_SOURCE_ETIF:
            /* configure TIMER external trigger input */
            timer_external_trigger_config(timer_dev->periph,oc_clear->trigger_prescaler,oc_clear->trigger_polarity,oc_clear->trigger_filter);
            /* configure TIMER OCPRE clear source selection */
            timer_ocpre_clear_source_config(timer_dev->periph, TIMER_OCPRE_CLEAR_SOURCE_ETIF) ;
            break;
        default:
            HAL_DEBUGW("parameter [oc_clear->ocpre_clear_source] value is undefine");
            break;
    }
    
    /* configure TIMER channel output clear function */
    if(ENABLE == (oc_clear->ocpre_clear_state)){
        timer_channel_output_clear_config(timer_dev->periph,channel,TIMER_OC_CLEAR_ENABLE);
    }else{
        timer_channel_output_clear_config(timer_dev->periph,channel,TIMER_OC_CLEAR_DISABLE);
    }
    
