SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_timer.c
    return HAL_ERR_NONE;
}

/*!
    \brief      TIMER CI0 trigger input selection 
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  ci0_select:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CI0_CH0IN: the TIMERx_CH0 pin input is selected as channel 0 trigger input
      \arg        TIMER_CI0_XOR_CH012: the result of combinational XOR of TIMERx_CH0,CH1 and CH2 pins is selected as channel 0 trigger input
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL details refer to gd32e23x_hal.h
*/
int32_t hal_timer_ci0_input_selection(hal_timer_dev_struct *timer_dev, uint32_t ci0_select)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if((TIMER_CI0_CH0IN != ci0_select) && (TIMER_CI0_XOR_CH012 != ci0_select)){
        HAL_DEBUGE("parameter ci0_select is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* configure TIMER hall sensor mode */
    timer_hall_mode_config(timer_dev->periph,ci0_select);
    return HAL_ERR_NONE;
}

/*!
    \brief      TIMERx remap 
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  remap:
                only one parameter can be selected which is shown as below:
      \arg        TIMER13_CI0_RMP_GPIO: timer13 channel 0 input is connected to GPIO(TIMER13_CH0)
      \arg        TIMER13_CI0_RMP_RTCCLK: timer13 channel 0 input is connected to the RTCCLK
      \arg        TIMER13_CI0_RMP_HXTAL_DIV32: timer13 channel 0 input is connected to HXTAL/32 clock
      \arg        TIMER13_CI0_RMP_CKOUTSEL: timer13 channel 0 input is connected to CKOUTSEL
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_remap_config(hal_timer_dev_struct *timer_dev,uint32_t remap)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    
    /* configure TIMER channel remap function */
    if(TIMER13 == timer_dev->periph){
        timer_channel_remap_config(TIMER13,remap);
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      TIMER generate a software event 
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  event_src:
                    the argument could be selected from enumeration <hal_timer_software_event_enum>
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_generate_event(hal_timer_dev_struct *timer_dev, hal_timer_software_event_enum event_src)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* software generate events  */
    timer_event_software_generate(timer_dev->periph, event_src);
    return HAL_ERR_NONE;
}

/*!
    \brief      initialize TIMER output compare mode
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,2))
    \param[in]  timer_compare: TIMER output compare mode struct
                  output_mode: 
                    the argument could be selected from enumeration <hal_timer_output_compare_enum>
                  output_pulse:0~65535
                  output_fastmode: TIMER_OC_FAST_ENABLE, TIMER_OC_FAST_DISABLE
                  output_polarity: TIMER_OC_POLARITY_HIGH, TIMER_OC_POLARITY_LOW
                  outputn_polarity: TIMER_OCN_POLARITY_HIGH, TIMER_OCN_POLARITY_LOW
                  output_idlestate: TIMER_OC_IDLE_STATE_LOW, TIMER_OC_IDLE_STATE_HIGH
                  outputn_idlestate: TIMER_OCN_IDLE_STATE_LOW, TIMER_OCN_IDLE_STATE_HIGH
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_outputcompare_init(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_outputcompare_struct *timer_compare)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    /* check the parameters */
    if(NULL == timer_compare){
        HAL_DEBUGE("pointer [timer_compare] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */


    switch(channel){
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        /* configure TIMER channel enable state */
        timer_channel_output_state_config(timer_dev->periph,TIMER_CH_0,TIMER_CCX_DISABLE);
        if((TIMER0 == timer_dev->periph) || (TIMER14 == timer_dev->periph) || (TIMER15 == timer_dev->periph) || (TIMER16 == timer_dev->periph)){
            /* configure TIMER channel complementary output enable state */
            timer_channel_complementary_output_state_config(timer_dev->periph,TIMER_CH_0,TIMER_CCXN_DISABLE);
            timer_channel_complementary_output_polarity_config(timer_dev->periph, TIMER_CH_0, timer_compare->outputn_polarity);
            /* reset the ISO0 bit */
            TIMER_CTL1(timer_dev->periph) &= (~(uint32_t)TIMER_CTL1_ISO0);
            /* set the ISO0 bit */
            TIMER_CTL1(timer_dev->periph) |= (uint32_t)timer_compare->output_idlestate;
            /* reset the ISO0N bit */
            TIMER_CTL1(timer_dev->periph) &= (~(uint32_t)TIMER_CTL1_ISO0N);
            /* set the ISO0N bit */
            TIMER_CTL1(timer_dev->periph) |= (uint32_t)timer_compare->outputn_idlestate;
        }
        TIMER_CHCTL0(timer_dev->periph) &= ~(uint32_t)TIMER_CHCTL0_CH0MS;
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        /* configure TIMER channel enable state */
        timer_channel_output_state_config(timer_dev->periph,TIMER_CH_1,TIMER_CCX_DISABLE);
        if((TIMER0 == timer_dev->periph) || (TIMER14 == timer_dev->periph)){
            if(TIMER0 == timer_dev->periph){
                /* configure TIMER channel complementary output enable state */
                timer_channel_complementary_output_state_config(timer_dev->periph,TIMER_CH_1,TIMER_CCXN_DISABLE);
                timer_channel_complementary_output_polarity_config(timer_dev->periph, TIMER_CH_1, timer_compare->outputn_polarity);
                /* reset the ISO1N bit */
                TIMER_CTL1(timer_dev->periph) &= (~(uint32_t)TIMER_CTL1_ISO1N);
                /* set the ISO1N bit */
                TIMER_CTL1(timer_dev->periph) |= (uint32_t)((uint32_t)(timer_compare->outputn_idlestate) << 2U);
            }
            /* reset the ISO1 bit */
            TIMER_CTL1(timer_dev->periph) &= (~(uint32_t)TIMER_CTL1_ISO1);
            /* set the ISO1 bit */
            TIMER_CTL1(timer_dev->periph) |= (uint32_t)((uint32_t)(timer_compare->output_idlestate) << 2U);

