SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_timer.c
    case TIMER_CH_2:
        /* disable the TIMER compare 2 interrupt */
        timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH2);
        break;

    default:
        break;
    }

    /* configure TIMER channel complementary output enable state */
    timer_channel_complementary_output_state_config(timer_dev->periph, channel, TIMER_CCXN_DISABLE);
    if(RESET == (TIMER_CHCTL2(timer_dev->periph) & (TIMER_CHCTL2_CH0NEN | TIMER_CHCTL2_CH1NEN | TIMER_CHCTL2_CH2NEN))){
        /* disable the TIMER interrupt */
        timer_interrupt_disable(timer_dev->periph, TIMER_INT_BRK);
    }
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER complementary output compare mode and channel dma request
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2))
    \param[in]  buffer: the source memory buffer address
    \param[in]  blength: the number of data to be transferred from source to destination
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_start_outputcompare_negtive_dma(hal_timer_dev_struct *timer_dev, uint16_t channel, uint32_t *buffer, uint16_t blength)
{
    hal_dma_irq_struct dma_irq;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    
    dma_irq.full_finish_handle = _channel_compare_pwm_dmatc_callback;
    dma_irq.half_finish_handle = NULL;
    dma_irq.error_handle = _timer_dmaerror_callback;
    
    switch (channel){
    case TIMER_CH_0:
        /* enable the DMA CH0 interrupt */
        hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_CH0], (uint32_t)buffer,TIMER_CH0CV_ADDRESS(timer_dev->periph),blength, &dma_irq);
        timer_dma_enable(timer_dev->periph, TIMER_DMA_CH0D);
        break;

    case TIMER_CH_1:
        /* enable the DMA CH1 interrupt */
        hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_CH1], (uint32_t)buffer,TIMER_CH1CV_ADDRESS(timer_dev->periph),blength, &dma_irq);
        timer_dma_enable(timer_dev->periph, TIMER_DMA_CH1D);
        break;

    case TIMER_CH_2:
        /* enable the DMA CH2 interrupt */
        hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_CH2], (uint32_t)buffer,TIMER_CH2CV_ADDRESS(timer_dev->periph),blength, &dma_irq);
        timer_dma_enable(timer_dev->periph, TIMER_DMA_CH2D);
        break;

    default:
        break;
    }

    /* configure TIMER channel complementary output enable state */
    timer_channel_complementary_output_state_config(timer_dev->periph, channel, TIMER_CCXN_ENABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, ENABLE);
    /* enable a TIMER */
    timer_enable(timer_dev->periph);

    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER complementary output compare mode and channel dma request
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_stop_outputcompare_negtive_dma(hal_timer_dev_struct *timer_dev, uint16_t channel)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    switch (channel){
    case TIMER_CH_0:
        /* disbale the DMA CH0 interrupt */
        timer_dma_disable(timer_dev->periph, TIMER_DMA_CH0D);
        /* stop DMA transfer */
        hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH0]);
        break;

    case TIMER_CH_1:
        /* disbale the DMA CH0 interrupt */
        timer_dma_disable(timer_dev->periph, TIMER_DMA_CH1D);
        /* stop DMA transfer */
        hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH1]);
        break;

    case TIMER_CH_2:
        /* disbale the DMA CH0 interrupt */
        timer_dma_disable(timer_dev->periph, TIMER_DMA_CH2D);
        /* stop DMA transfer */
        hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH2]);
        break;

    default:
        break;
    }

    /* configure TIMER channel complementary output enable state */
    timer_channel_complementary_output_state_config(timer_dev->periph, channel, TIMER_CCXN_DISABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    return ret_val;
}

/*!
    \brief      initialize TIMER pwm mode
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,2))
    \param[in]  timer_compare: TIMER output compare mode struct
                  output_mode: 
                    the argument could be selected from enumeration <hal_timer_output_compare_enum>
                  output_pulse:0~65535
                  output_fastmode: TIMER_OC_FAST_ENABLE, TIMER_OC_FAST_DISABLE
                  output_polarity: TIMER_OC_POLARITY_HIGH, TIMER_OC_POLARITY_LOW
                  outputn_polarity: TIMER_OCN_POLARITY_HIGH, TIMER_OCN_POLARITY_LOW
                  output_idlestate: TIMER_OC_IDLE_STATE_LOW, TIMER_OC_IDLE_STATE_HIGH
                  outputn_idlestate: TIMER_OCN_IDLE_STATE_LOW, TIMER_OCN_IDLE_STATE_HIGH
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_pwm_init(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_outputcompare_struct *timer_compare)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    /* check the parameters */
    if(NULL == timer_compare){
        HAL_DEBUGE("pointer [timer_compare] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */


