SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_timer.c
    switch(channel){
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        /* configure TIMER channel enable state */
        timer_channel_output_state_config(timer_dev->periph,TIMER_CH_0,TIMER_CCX_DISABLE);
        if((TIMER0 == timer_dev->periph) || (TIMER14 == timer_dev->periph) || (TIMER15 == timer_dev->periph) || (TIMER16 == timer_dev->periph)){
            /* configure TIMER channel complementary output enable state */
            timer_channel_complementary_output_state_config(timer_dev->periph,TIMER_CH_0,TIMER_CCXN_DISABLE);
            timer_channel_complementary_output_polarity_config(timer_dev->periph, TIMER_CH_0, timer_compare->outputn_polarity);
            /* reset the ISO0 bit */
            TIMER_CTL1(timer_dev->periph) &= (~(uint32_t)TIMER_CTL1_ISO0);
            /* set the ISO0 bit */
            TIMER_CTL1(timer_dev->periph) |= (uint32_t)timer_compare->output_idlestate;
            /* reset the ISO0N bit */
            TIMER_CTL1(timer_dev->periph) &= (~(uint32_t)TIMER_CTL1_ISO0N);
            /* set the ISO0N bit */
            TIMER_CTL1(timer_dev->periph) |= (uint32_t)timer_compare->outputn_idlestate;
        }
        TIMER_CHCTL0(timer_dev->periph) &= ~(uint32_t)TIMER_CHCTL0_CH0MS;
        TIMER_CHCTL0(timer_dev->periph) |= TIMER_CHCTL0_CH0COMSEN;
        timer_channel_output_fast_config(timer_dev->periph, channel, timer_compare->output_fastmode);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        /* configure TIMER channel enable state */
        timer_channel_output_state_config(timer_dev->periph,TIMER_CH_1,TIMER_CCX_DISABLE);
        if((TIMER0 == timer_dev->periph) || (TIMER14 == timer_dev->periph)){
            if(TIMER0 == timer_dev->periph){
                /* configure TIMER channel complementary output enable state */
                timer_channel_complementary_output_state_config(timer_dev->periph,TIMER_CH_1,TIMER_CCXN_DISABLE);
                timer_channel_complementary_output_polarity_config(timer_dev->periph, TIMER_CH_1, timer_compare->outputn_polarity);
                /* reset the ISO1N bit */
                TIMER_CTL1(timer_dev->periph) &= (~(uint32_t)TIMER_CTL1_ISO1N);
                /* set the ISO1N bit */
                TIMER_CTL1(timer_dev->periph) |= (uint32_t)((uint32_t)(timer_compare->outputn_idlestate) << 2U);
            }
            /* reset the ISO1 bit */
            TIMER_CTL1(timer_dev->periph) &= (~(uint32_t)TIMER_CTL1_ISO1);
            /* set the ISO1 bit */
            TIMER_CTL1(timer_dev->periph) |= (uint32_t)((uint32_t)(timer_compare->output_idlestate) << 2U);

        }
        TIMER_CHCTL0(timer_dev->periph) &= ~(uint32_t)TIMER_CHCTL0_CH1MS;
        TIMER_CHCTL0(timer_dev->periph) |= TIMER_CHCTL0_CH1COMSEN;
        timer_channel_output_fast_config(timer_dev->periph, channel, timer_compare->output_fastmode);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        /* configure TIMER channel enable state */
        timer_channel_output_state_config(timer_dev->periph,TIMER_CH_2,TIMER_CCX_DISABLE);
        if(TIMER0 == timer_dev->periph){
            /* configure TIMER channel complementary output enable state */
            timer_channel_complementary_output_state_config(timer_dev->periph,TIMER_CH_2,TIMER_CCXN_DISABLE);
            timer_channel_complementary_output_polarity_config(timer_dev->periph, TIMER_CH_2, timer_compare->outputn_polarity);

            /* reset the ISO2 bit */
            TIMER_CTL1(timer_dev->periph) &= (~(uint32_t)TIMER_CTL1_ISO2);
            /* set the ISO2 bit */
            TIMER_CTL1(timer_dev->periph) |= (uint32_t)((uint32_t)(timer_compare->output_idlestate) << 4U);
            /* reset the ISO2N bit */
            TIMER_CTL1(timer_dev->periph) &= (~(uint32_t)TIMER_CTL1_ISO2N);
            /* set the ISO2N bit */
            TIMER_CTL1(timer_dev->periph) |= (uint32_t)((uint32_t)(timer_compare->outputn_idlestate) << 4U);
        }
        TIMER_CHCTL1(timer_dev->periph) &= ~(uint32_t)TIMER_CHCTL1_CH2MS;
        TIMER_CHCTL1(timer_dev->periph) |= TIMER_CHCTL1_CH2COMSEN;
        timer_channel_output_fast_config(timer_dev->periph, channel, timer_compare->output_fastmode);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        /* configure TIMER channel enable state */
        timer_channel_output_state_config(timer_dev->periph,TIMER_CH_3,TIMER_CCX_DISABLE);
        if(TIMER0 == timer_dev->periph){
            /* reset the ISO3 bit */
            TIMER_CTL1(timer_dev->periph) &= (~(uint32_t)TIMER_CTL1_ISO3);
            /* set the ISO3 bit */
            TIMER_CTL1(timer_dev->periph) |= (uint32_t)((uint32_t)(timer_compare->output_idlestate) << 6U);
        }
        TIMER_CHCTL1(timer_dev->periph) &= ~(uint32_t)TIMER_CHCTL1_CH3MS;
        TIMER_CHCTL1(timer_dev->periph) |= TIMER_CHCTL1_CH3COMSEN;
        timer_channel_output_fast_config(timer_dev->periph, channel, timer_compare->output_fastmode);
        break;
    default:
        break;
    }

    /* configure TIMER channel output compare mode */
    timer_channel_output_mode_config(timer_dev->periph, channel,timer_compare->output_mode);
    /* configure TIMER channel output pulse value */
    timer_channel_output_pulse_value_config(timer_dev->periph, channel, timer_compare->output_pulse);
    /* configure TIMER channel output polarity */
    timer_channel_output_polarity_config(timer_dev->periph, channel, timer_compare->output_polarity);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      start TIMER pwm mode
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,2))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_start_pwm(hal_timer_dev_struct *timer_dev, uint16_t channel)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    
    /* configure TIMER channel enable state */
    timer_channel_output_state_config(timer_dev->periph, channel, TIMER_CCX_ENABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, ENABLE);
    /* enable a TIMER */
    timer_enable(timer_dev->periph);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER pwm mode
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,2))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_stop_pwm(hal_timer_dev_struct *timer_dev, uint16_t channel)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* configure TIMER channel enable state */
    timer_channel_output_state_config(timer_dev->periph, channel, TIMER_CCX_DISABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER pwm mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,2))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_start_pwm_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    
    switch (channel){
    case TIMER_CH_0:
        /* enable the TIMER compare 0 interrupt */
        timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH0);
        break;

    case TIMER_CH_1:
        /* enable the TIMER compare 1 interrupt */
        timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH1);
        break;

