SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_timer.c
    switch(channel){
        case TIMER_CH_0:
            /* enable the TIMER interrupt */
            timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH0);
            break;
        case TIMER_CH_1:
            /* enable the TIMER interrupt */
            timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH1);
            break;
        case TIMER_CH_2:
            /* enable the TIMER interrupt */
            timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH2);
            break;
        case TIMER_CH_3:
            /* enable the TIMER interrupt */
            timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH3);
            break;
        default:
            HAL_DEBUGE("parameter [channel] value is invalid");
            return HAL_ERR_VAL;
    }
    /* configure TIMER channel enable state */
    timer_channel_output_state_config(timer_dev->periph, channel, TIMER_CCX_ENABLE);
    /* enable a TIMER */
    timer_enable(timer_dev->periph);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER input capture mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,2))
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_stop_inputcapture_interrupt(hal_timer_dev_struct *timer_dev, uint32_t channel)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    switch(channel){
        case TIMER_CH_0:
            /* disable the TIMER interrupt */
            timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH0);
            break;
        case TIMER_CH_1:
            /* disable the TIMER interrupt */
            timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH1);
            break;
        case TIMER_CH_2:
            /* disable the TIMER interrupt */
            timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH2);
            break;
        case TIMER_CH_3:
            /* disable the TIMER interrupt */
            timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH3);
            break;
        default:
            HAL_DEBUGE("parameter [channel] value is invalid");
            return HAL_ERR_VAL;
    }
    /* configure TIMER channel enable state */
    timer_channel_output_state_config(timer_dev->periph, channel, TIMER_CCX_DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER channel input capture and channel dma request
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,2))
    \param[in]  buffer: the source memory buffer address
    \param[in]  blength: the number of data to be transferred from source to destination
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_start_inputcapture_dma(hal_timer_dev_struct *timer_dev, uint32_t channel, uint32_t *buffer, uint16_t blength)
{
    hal_dma_irq_struct dma_irq;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    switch(channel){
        case TIMER_CH_0:
        /* channel DMA config */
        dma_irq.full_finish_handle = _channel_capture_dmatc_callback;
        dma_irq.half_finish_handle = NULL;
        dma_irq.error_handle = _timer_dmaerror_callback;
        /* start DMA interrupt mode transfer */
        hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_CH0], TIMER_CH0CV_ADDRESS(timer_dev->periph), (uint32_t)buffer, blength, &dma_irq);
        timer_dma_enable(timer_dev->periph, TIMER_DMA_CH0D);
            break;
        case TIMER_CH_1:
        /* channel DMA config */
        dma_irq.full_finish_handle = _channel_capture_dmatc_callback;
        dma_irq.half_finish_handle = NULL;
        dma_irq.error_handle = _timer_dmaerror_callback;
        /* start DMA interrupt mode transfer */
        hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_CH1], TIMER_CH1CV_ADDRESS(timer_dev->periph), (uint32_t)buffer, blength, &dma_irq);
        timer_dma_enable(timer_dev->periph, TIMER_DMA_CH1D);
            break;
        case TIMER_CH_2:
        /* channel DMA config */
        dma_irq.full_finish_handle = _channel_capture_dmatc_callback;
        dma_irq.half_finish_handle = NULL;
        dma_irq.error_handle = _timer_dmaerror_callback;
        /* start DMA interrupt mode transfer */
        hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_CH2],  TIMER_CH2CV_ADDRESS(timer_dev->periph), (uint32_t)buffer, blength, &dma_irq);
        timer_dma_enable(timer_dev->periph, TIMER_DMA_CH2D);
            break;
        case TIMER_CH_3:
        /* channel DMA config */
        dma_irq.full_finish_handle = _channel_capture_dmatc_callback;
        dma_irq.half_finish_handle = NULL;
        dma_irq.error_handle = _timer_dmaerror_callback;
        /* start DMA interrupt mode transfer */
        hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_CH3], TIMER_CH3CV_ADDRESS(timer_dev->periph), (uint32_t)buffer,  blength, &dma_irq);
        timer_dma_enable(timer_dev->periph, TIMER_DMA_CH3D);
            break;
        default:
            HAL_DEBUGE("parameter [channel] value is invalid");
            return HAL_ERR_VAL;
    }
    /* configure TIMER channel enable state */
    timer_channel_output_state_config(timer_dev->periph, channel, TIMER_CCX_ENABLE);
    /* enable a TIMER */
    timer_enable(timer_dev->periph);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER channel input capture and channel dma request
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,2))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_VAL, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_stop_inputcapture_dma(hal_timer_dev_struct *timer_dev, uint32_t channel)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

