SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_timer.c
    switch(channel){
        case TIMER_CH_0:
            /* disable the TIMER DMA */
            timer_dma_disable(timer_dev->periph, TIMER_DMA_CH0D);
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH0]);
            break;
        case TIMER_CH_1:
            /* disable the TIMER DMA */
            timer_dma_disable(timer_dev->periph, TIMER_DMA_CH1D);
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH1]);
            break;
        case TIMER_CH_2:
            /* disable the TIMER DMA */
            timer_dma_disable(timer_dev->periph, TIMER_DMA_CH2D);
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH2]);
            break;
        case TIMER_CH_3:
            /* disable the TIMER DMA */
            timer_dma_disable(timer_dev->periph, TIMER_DMA_CH3D);
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH3]);
            break;
        default:
            HAL_DEBUGE("parameter [channel] value is invalid");
            return HAL_ERR_VAL;
    }
    /* configure TIMER channel enable state */
    timer_channel_output_state_config(timer_dev->periph, channel, TIMER_CCX_DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    return ret_val;
}

/*!
    \brief      read TIMER channel capture compare register value
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel: 
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,2))
    \param[out] none
    \retval     channel capture compare register value
*/
uint32_t hal_timer_read_capture_value(hal_timer_dev_struct *timer_dev, uint16_t channel)
{
    uint32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* read TIMER channel capture compare register value */
    ret_val = timer_channel_capture_value_register_read(timer_dev->periph, channel);
    return ret_val;
}

/*!
    \brief      initialize TIMER single pulse mode
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timer_singlepulse:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SP_MODE_SINGLE: single pulse mode
      \arg        TIMER_SP_MODE_REPETITIVE: repetitive pulse mode
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_singlepulse_mode_init(hal_timer_dev_struct *timer_dev, uint32_t timer_singlepulse)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* configure TIMER single pulse mode */
    timer_single_pulse_mode_config(timer_dev->periph, timer_singlepulse);
    return HAL_ERR_NONE;
}

/*!
    \brief      TIMER single pulse mode configure
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  singlepulse: TIMER single pulse mode struct
                  sp_ocmode:
                    the argument could be selected from enumeration <hal_timer_output_compare_enum>
                sp_pulse:0~65535
                sp_ocpolarity:TIMER_OC_POLARITY_HIGH,TIMER_OC_POLARITY_LOW
                sp_ocnpolarity:TIMER_OCN_POLARITY_HIGH,TIMER_OCN_POLARITY_LOW
                sp_ocidlestate:TIMER_OC_IDLE_STATE_LOW,TIMER_OC_IDLE_STATE_HIGH
                sp_ocnidlestate:TIMER_OCN_IDLE_STATE_LOW,TIMER_OCN_IDLE_STATE_HIGH
                sp_ci_selection:TIMER_IC_SELECTION_DIRECTTI,TIMER_IC_SELECTION_INDIRECTTI,TIMER_IC_SELECTION_ITS
                sp_ci_polarity:TIMER_IC_POLARITY_RISING,TIMER_IC_POLARITY_FALLING,TIMER_IC_POLARITY_BOTH_EDGE
                sp_ci_filter:0~15
    \param[in]  channel_out: TIMER output channel.The channel will output single pulse
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
    \param[in]  channel_in: TIMER input channel.If the channel input a active signal,TIMER will start count.
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_singlepulse_channel_config(hal_timer_dev_struct *timer_dev,hal_timer_singlepulse_struct *singlepulse,uint32_t channel_out,uint32_t channel_in)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(NULL == singlepulse){
        HAL_DEBUGE("pointer [singlepulse] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if(channel_out != channel_in){
        switch(channel_out){
            case TIMER_CH_0:
            /* configure TIMER channel enable state */
            timer_channel_output_state_config(timer_dev->periph,TIMER_CH_0,TIMER_CCX_DISABLE);
            if((TIMER0 == timer_dev->periph) || (TIMER14 == timer_dev->periph) || (TIMER15 == timer_dev->periph) || (TIMER16 == timer_dev->periph)){
                /* configure TIMER channel complementary output enable state */
                timer_channel_complementary_output_state_config(timer_dev->periph,TIMER_CH_0,TIMER_CCXN_DISABLE);
                timer_channel_complementary_output_polarity_config(timer_dev->periph, TIMER_CH_0, singlepulse->sp_ocnpolarity);
                /* reset the ISO0 bit */
                TIMER_CTL1(timer_dev->periph) &= (~(uint32_t)TIMER_CTL1_ISO0);
                /* set the ISO0 bit */
                TIMER_CTL1(timer_dev->periph) |= (uint32_t)singlepulse->sp_ocidlestate;
                /* reset the ISO0N bit */
                TIMER_CTL1(timer_dev->periph) &= (~(uint32_t)TIMER_CTL1_ISO0N);
                /* set the ISO0N bit */
                TIMER_CTL1(timer_dev->periph) |= (uint32_t)singlepulse->sp_ocnidlestate;
            }
            TIMER_CHCTL0(timer_dev->periph) &= ~(uint32_t)TIMER_CHCTL0_CH0MS;
                break;
            case TIMER_CH_1:
            /* configure TIMER channel enable state */
            timer_channel_output_state_config(timer_dev->periph,TIMER_CH_1,TIMER_CCX_DISABLE);
            if((TIMER0 == timer_dev->periph) || (TIMER14 == timer_dev->periph)){
                if(TIMER0 == timer_dev->periph){
                    /* configure TIMER channel complementary output enable state */
                    timer_channel_complementary_output_state_config(timer_dev->periph,TIMER_CH_1,TIMER_CCXN_DISABLE);
                    timer_channel_complementary_output_polarity_config(timer_dev->periph, TIMER_CH_1, singlepulse->sp_ocnpolarity);
                    /* reset the ISO1N bit */
                    TIMER_CTL1(timer_dev->periph) &= (~(uint32_t)TIMER_CTL1_ISO1N);
                    /* set the ISO1N bit */
                    TIMER_CTL1(timer_dev->periph) |= (uint32_t)((uint32_t)(singlepulse->sp_ocnidlestate) << 2U);
                }
                /* reset the ISO1 bit */
                TIMER_CTL1(timer_dev->periph) &= (~(uint32_t)TIMER_CTL1_ISO1);
                /* set the ISO1 bit */
                TIMER_CTL1(timer_dev->periph) |= (uint32_t)((uint32_t)(singlepulse->sp_ocidlestate) << 2U);

