SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_timer.c
            }
            TIMER_CHCTL0(timer_dev->periph) &= ~(uint32_t)TIMER_CHCTL0_CH1MS;
                break;
            default:
                HAL_DEBUGE("parameter [channel_out] value is invalid");
                return HAL_ERR_VAL;
        }
        /* configure TIMER channel output compare mode */
        timer_channel_output_mode_config(timer_dev->periph, channel_out,singlepulse->sp_ocmode);
        /* configure TIMER channel output pulse value */
        timer_channel_output_pulse_value_config(timer_dev->periph, channel_out, singlepulse->sp_pulse);
        /* configure TIMER channel output polarity */
        timer_channel_output_polarity_config(timer_dev->periph, channel_out, singlepulse->sp_ocpolarity);
        
        switch(channel_in){
            case TIMER_CH_0:
            /* reset the CH0EN bit */
            TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);

            /* reset the CH0P and CH0NP bits */
            TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_CH0NP));
            TIMER_CHCTL2(timer_dev->periph) |= (uint32_t)(singlepulse->sp_ci_polarity);
            if(((TIMER0 == timer_dev->periph) || (TIMER2 == timer_dev->periph) || (TIMER14 == timer_dev->periph))){
                /* reset the CH0MS bit */
                TIMER_CHCTL0(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL0_CH0MS);
                TIMER_CHCTL0(timer_dev->periph) |= (uint32_t)(singlepulse->sp_ci_selection);
            }else
            {
                /* reset the CH0MS bit */
                TIMER_CHCTL0(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL0_CH0MS);
                TIMER_CHCTL0(timer_dev->periph) |= (uint32_t)TIMER_IC_SELECTION_DIRECTTI;
            }
            /* reset the CH0CAPFLT bit */
            TIMER_CHCTL0(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
            TIMER_CHCTL0(timer_dev->periph) |= (uint32_t)((uint32_t)(singlepulse->sp_ci_filter) << 4U);
            
            /* configure TIMER channel input capture prescaler value */
            timer_channel_input_capture_prescaler_config(timer_dev->periph, channel_in,TIMER_IC_PSC_DIV1);
            /* select TIMER input trigger source */
            timer_input_trigger_source_select(timer_dev->periph,TIMER_SMCFG_TRGSEL_CI0FE0);
            /* select TIMER slave mode */
            timer_slave_mode_select(timer_dev->periph, TIMER_SLAVE_MODE_EVENT);

                break;
            case TIMER_CH_1:
            /* reset the CH1EN bit */
            TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);

            /* reset the CH1P and CH1NP bits */
            TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_CH1NP));
            TIMER_CHCTL2(timer_dev->periph) |= (uint32_t)((uint32_t)(singlepulse->sp_ci_polarity) << 4U);
            /* reset the CH1MS bit */
            TIMER_CHCTL0(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL0_CH1MS);
            TIMER_CHCTL0(timer_dev->periph) |= (uint32_t)((uint32_t)(singlepulse->sp_ci_selection) << 8U);
            /* reset the CH1CAPFLT bit */
            TIMER_CHCTL0(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL0_CH1CAPFLT);
            TIMER_CHCTL0(timer_dev->periph) |= (uint32_t)((uint32_t)(singlepulse->sp_ci_filter) << 12U);
            
            /* configure TIMER channel input capture prescaler value */
            timer_channel_input_capture_prescaler_config(timer_dev->periph, channel_in,TIMER_IC_PSC_DIV1);
            /* select TIMER input trigger source */
            timer_input_trigger_source_select(timer_dev->periph,TIMER_SMCFG_TRGSEL_CI1FE1);
            /* select TIMER slave mode */
            timer_slave_mode_select(timer_dev->periph, TIMER_SLAVE_MODE_EVENT);
                break;
            default:
                HAL_DEBUGE("parameter [channel_in] value is invalid");
                return HAL_ERR_VAL;
        }
        return HAL_ERR_NONE;
    }else{
        return HAL_ERR_VAL;
    }
}

/*!
    \brief      start TIMER single pulse mode
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  out_channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_start_singlepulse(hal_timer_dev_struct *timer_dev, uint32_t out_channel)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* configure TIMER channel enable state */
    timer_channel_output_state_config(timer_dev->periph,TIMER_CH_0, TIMER_CCX_ENABLE);
    timer_channel_output_state_config(timer_dev->periph,TIMER_CH_1, TIMER_CCX_ENABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, ENABLE);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER single pulse mode
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  out_channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_stop_singlepulse(hal_timer_dev_struct *timer_dev, uint32_t out_channel)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* configure TIMER channel enable state */
    timer_channel_output_state_config(timer_dev->periph,TIMER_CH_0, TIMER_CCX_DISABLE);
    timer_channel_output_state_config(timer_dev->periph,TIMER_CH_1, TIMER_CCX_DISABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER single pulse mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  out_channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_start_singlepulse_interrupt(hal_timer_dev_struct *timer_dev, uint32_t out_channel)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* enable the TIMER interrupt */
    timer_interrupt_enable(timer_dev->periph,TIMER_INT_CH0);
    timer_interrupt_enable(timer_dev->periph,TIMER_INT_CH1);
    /* configure TIMER channel enable state */
    timer_channel_output_state_config(timer_dev->periph,TIMER_CH_0, TIMER_CCX_ENABLE);
    timer_channel_output_state_config(timer_dev->periph,TIMER_CH_1, TIMER_CCX_ENABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, ENABLE);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER single pulse mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  out_channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_stop_singlepulse_interrupt(hal_timer_dev_struct *timer_dev, uint32_t out_channel)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* disable the TIMER interrupt */
    timer_interrupt_disable(timer_dev->periph,TIMER_INT_CH0);
    timer_interrupt_disable(timer_dev->periph,TIMER_INT_CH1);
    /* configure TIMER channel enable state */
    timer_channel_output_state_config(timer_dev->periph,TIMER_CH_0, TIMER_CCX_DISABLE);
    timer_channel_output_state_config(timer_dev->periph,TIMER_CH_1, TIMER_CCX_DISABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER complementay channel single pulse mode
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  out_channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_start_negtive_singlepulse(hal_timer_dev_struct *timer_dev, uint16_t out_channel)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* configure TIMER channel enable state */
    timer_channel_complementary_output_state_config(timer_dev->periph, out_channel, TIMER_CCXN_ENABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, ENABLE);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER complementay channel single pulse mode
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  out_channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_stop_negtive_singlepulse(hal_timer_dev_struct *timer_dev, uint16_t out_channel)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* configure TIMER channel enable state */
    timer_channel_complementary_output_state_config(timer_dev->periph, out_channel, TIMER_CCXN_DISABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER complementay channel single pulse mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  out_channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_start_negtive_singlepulse_interrupt(hal_timer_dev_struct *timer_dev, uint16_t out_channel)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* enable the TIMER interrupt */
    timer_interrupt_enable(timer_dev->periph,TIMER_INT_CH0);
    timer_interrupt_enable(timer_dev->periph,TIMER_INT_CH1);
    /* configure TIMER channel enable state */
    timer_channel_complementary_output_state_config(timer_dev->periph, out_channel, TIMER_CCXN_ENABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, ENABLE);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER complementay channel single pulse mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  out_channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_stop_negtive_singlepulse_interrupt(hal_timer_dev_struct *timer_dev, uint16_t out_channel)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* disable the TIMER interrupt */
    timer_interrupt_disable(timer_dev->periph,TIMER_INT_CH0);
    timer_interrupt_disable(timer_dev->periph,TIMER_INT_CH1);
    /* configure TIMER channel enable state */
    timer_channel_complementary_output_state_config(timer_dev->periph, out_channel, TIMER_CCXN_DISABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    return ret_val;
}

/*!
    \brief      initialize TIMER quadrature decoder mode
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  decode:
                  decodemode:TIMER_QUADRATURE_DECODER_MODE0, TIMER_QUADRATURE_DECODER_MODE1, TIMER_QUADRATURE_DECODER_MODE2
                  ci0_polarity/ci1_polarity: TIMER_IC_POLARITY_RISING,TIMER_IC_POLARITY_FALLING
                  ci0_selection/ci1_selection: TIMER_IC_SELECTION_DIRECTTI,TIMER_IC_SELECTION_INDIRECTTI,TIMER_IC_SELECTION_ITS
                  ci0_prescaler/ci1_prescaler: TIMER_IC_PSC_DIV1,TIMER_IC_PSC_DIV2,TIMER_IC_PSC_DIV4,TIMER_IC_PSC_DIV8
                  ci0_filter/ci1_filter: 0~15
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_quadrature_decoder_init(hal_timer_dev_struct *timer_dev, hal_timer_quadrature_decoder_struct *decode)
{
    timer_ic_parameter_struct ic0_capture;
    timer_ic_parameter_struct ic1_capture;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    TIMER_SMCFG(timer_dev->periph) &= (~(uint32_t)TIMER_SMCFG_SMC);
    TIMER_SMCFG(timer_dev->periph) |= (uint32_t)decode->decodemode;

    /* channel 0 input parameter struct */
    ic0_capture.icfilter = decode->ci0_filter;
    ic0_capture.icpolarity = decode->ci0_polarity;
    ic0_capture.icprescaler = decode->ci0_prescaler;
    ic0_capture.icselection = decode->ci0_selection;
    /* channel 1 input parameter struct */
    ic1_capture.icfilter = decode->ci1_filter;
    ic1_capture.icpolarity = decode->ci1_polarity;
    ic1_capture.icprescaler = decode->ci1_prescaler;
    ic1_capture.icselection = decode->ci1_selection;
    /* configure TIMER input capture parameter */
    timer_input_capture_config(timer_dev->periph, TIMER_CH_0, &ic0_capture);
    /* configure TIMER channel enable state */
    timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
    /* configure TIMER input capture parameter */
    timer_input_capture_config(timer_dev->periph, TIMER_CH_1, &ic1_capture);
    /* configure TIMER channel enable state */
    timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_DISABLE);
    return HAL_ERR_NONE;
}

/*!
    \brief      start TIMER quadrature decoder mode
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
      \arg        TIMER_CH_0_1: TIMER channel0 and TIMER channel1
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_start_quadrature_decoder(hal_timer_dev_struct *timer_dev, uint32_t channel)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

