SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_timer.c
    switch(channel){
        case TIMER_CH_0:
            /* configure TIMER channel 0 enable state */
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
            break;
        case TIMER_CH_1:
            /* configure TIMER channel 1 enable state */
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_ENABLE);
            break;
        case TIMER_CH_0_1:
            /* configure TIMER channel 0 and channel 1 enable state */
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_ENABLE);
            break;
        default:
            HAL_DEBUGW("parameter [channel] value is undefine");
            break;
    }
    /* enable a TIMER */
    timer_enable(timer_dev->periph);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER quadrature decoder mode
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
      \arg        TIMER_CH_0_1: TIMER channel0 and TIMER channel1
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_stop_quadrature_decoder(hal_timer_dev_struct *timer_dev, uint32_t channel)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    switch(channel){
        case TIMER_CH_0:
            /* configure TIMER channel 0 enable state */
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
            break;
        case TIMER_CH_1:
            /* configure TIMER channel 1 enable state */
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_DISABLE);
            break;
        case TIMER_CH_0_1:
            /* configure TIMER channel 0 and channel 1 enable state */
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_DISABLE);
            break;
        default:
            HAL_DEBUGW("parameter [channel] value is undefine");
            break;
    }
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER quadrature decoder mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
      \arg        TIMER_CH_0_1: TIMER channel0 and TIMER channel1
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_start_quadrature_decoder_interrupt(hal_timer_dev_struct *timer_dev, uint32_t channel)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    switch(channel){
        case TIMER_CH_0:
            /* configure TIMER channel 0 enable state */
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
            /* enable the TIMER interrupt */
            timer_interrupt_enable(timer_dev->periph, TIMER_CH_0);
            break;
        case TIMER_CH_1:
            /* configure TIMER channel 1 enable state */
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_ENABLE);
            /* enable the TIMER interrupt */
            timer_interrupt_enable(timer_dev->periph, TIMER_CH_1);
            break;
        case TIMER_CH_0_1:
            /* configure TIMER channel enable state */
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_ENABLE);
            /* enable the TIMER interrupt */
            timer_interrupt_enable(timer_dev->periph, TIMER_CH_0);
            timer_interrupt_enable(timer_dev->periph, TIMER_CH_1);
            break;
        default:
            HAL_DEBUGW("parameter [channel] value is undefine");
            break;
    }
    /* enable a TIMER */
    timer_enable(timer_dev->periph);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER quadrature decoder mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
      \arg        TIMER_CH_0_1: TIMER channel0 and TIMER channel1
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_stop_quadrature_decoder_interrupt(hal_timer_dev_struct *timer_dev, uint32_t channel)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

