SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_timer.c
    switch(channel){
        case TIMER_CH_0:
            /* configure TIMER channel enable state */
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
            /* disable the TIMER interrupt */
            timer_interrupt_disable(timer_dev->periph, TIMER_CH_0);
            break;
        case TIMER_CH_1:
            /* configure TIMER channel enable state */
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_DISABLE);
            /* disable the TIMER interrupt */
            timer_interrupt_disable(timer_dev->periph, TIMER_CH_1);
            break;
        case TIMER_CH_0_1:
            /* configure TIMER channel enable state */
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_DISABLE);
            /* disable the TIMER interrupt */
            timer_interrupt_disable(timer_dev->periph, TIMER_CH_0);
            timer_interrupt_disable(timer_dev->periph, TIMER_CH_1);
            break;
        default:
            HAL_DEBUGW("parameter [channel] value is undefine");
            break;
    }
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    
    return ret_val;
}

/*!
    \brief      start TIMER quadrature decoder mode and channel dma request
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
      \arg        TIMER_CH_0_1: TIMER channel0 and TIMER channel1
    \param[in]  buffer0: the source memory buffer address for channel0
    \param[in]  buffer1: the source memory buffer address for channel1
    \param[in]  blength: the number of data to be transferred from source to destination
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_start_quadrature_decoder_dma(hal_timer_dev_struct *timer_dev, uint32_t channel,
                                    uint32_t *buffer0, uint32_t *buffer1, uint16_t blength)
{
    hal_dma_irq_struct dma_irq;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    switch(channel){
        case TIMER_CH_0:
            /* channel DMA config */
            dma_irq.full_finish_handle = _channel_capture_dmatc_callback;
            dma_irq.half_finish_handle = NULL;
            dma_irq.error_handle = _timer_dmaerror_callback;
            /* start DMA interrupt mode transfer */
            hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_CH0], TIMER_CH0CV_ADDRESS(timer_dev->periph), (uint32_t)buffer0, blength, &dma_irq);
            timer_dma_enable(timer_dev->periph, TIMER_DMA_CH0D);
            /* configure TIMER channel enable state */
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
            /* enable a TIMER */
            timer_enable(timer_dev->periph);
            break;
        case TIMER_CH_1:
            /* channel DMA config */
            dma_irq.full_finish_handle = _channel_capture_dmatc_callback;
            dma_irq.half_finish_handle = NULL;
            dma_irq.error_handle = _timer_dmaerror_callback;
            /* start DMA interrupt mode transfer */
            hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_CH1], TIMER_CH1CV_ADDRESS(timer_dev->periph), (uint32_t)buffer1, blength, &dma_irq);
            timer_dma_enable(timer_dev->periph, TIMER_DMA_CH1D);
            /* configure TIMER channel enable state */
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_ENABLE);
            /* enable a TIMER */
            timer_enable(timer_dev->periph);
            break;
        case TIMER_CH_0_1:
            /* channel DMA config */
            dma_irq.full_finish_handle = _channel_capture_dmatc_callback;
            dma_irq.half_finish_handle = NULL;
            dma_irq.error_handle = _timer_dmaerror_callback;
            /* start DMA interrupt mode transfer */
            hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_CH0], TIMER_CH0CV_ADDRESS(timer_dev->periph), (uint32_t)buffer0, blength, &dma_irq);
            hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_CH1], TIMER_CH1CV_ADDRESS(timer_dev->periph), (uint32_t)buffer1, blength, &dma_irq);

            /* enable the TIMER DMA */
            timer_dma_enable(timer_dev->periph, TIMER_DMA_CH0D);
            timer_dma_enable(timer_dev->periph, TIMER_DMA_CH1D);
            /* configure TIMER channel enable state */
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_ENABLE);

            /* enable a TIMER */
            timer_enable(timer_dev->periph);
            break;
        default:
            HAL_DEBUGW("parameter [channel] value is undefine");
            break;
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER quadrature decoder mode and channel dma request
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
      \arg        TIMER_CH_0_1: TIMER channel0 and TIMER channel1
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_stop_quadrature_decoder_dma(hal_timer_dev_struct *timer_dev, uint32_t channel)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

