SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_timer.c
    switch(channel){
        case TIMER_CH_0:
            /* configure TIMER channel enable state */
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
            timer_dma_disable(timer_dev->periph, TIMER_DMA_CH0D);
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH0]);
            break;
        case TIMER_CH_1:
            /* configure TIMER channel enable state */
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_DISABLE);
            timer_dma_disable(timer_dev->periph, TIMER_DMA_CH1D);
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH1]);
            break;
        case TIMER_CH_0_1:
            /* configure TIMER channel enable state */
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
            timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_DISABLE);
            timer_dma_disable(timer_dev->periph, TIMER_DMA_CH0D);
            timer_dma_disable(timer_dev->periph, TIMER_DMA_CH1D);
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH0]);
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH1]);
            break;
        default:
            HAL_DEBUGW("parameter [channel] value is undefine");
            break;
    }
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER DMA mode for writing data to TIMER
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  dma_startaddr:
                    the argument could be selected from enumeration <hal_timer_dma_start_address_enum>
    \param[in]  dma_count: 
                only one parameter can be selected which is shown as below:
       \arg        TIMER_DMACFG_DMATC_xTRANSFER(x=1..18): DMA transfer x time
    \param[in]  dma_reqsrc: 
                    the argument could be selected from enumeration <hal_timer_dma_request_source_enum>
    \param[in]  srcbuffer: the source memory buffer address
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_start_dmatransfer_write(hal_timer_dev_struct *timer_dev, hal_timer_dma_start_address_enum dma_startaddr, uint32_t dma_count,\
                            hal_timer_dma_request_source_enum dma_reqsrc, uint32_t *srcbuffer)
{
    hal_dma_irq_struct dma_irq;
    uint32_t data_length = 0;
    data_length = (uint32_t)((dma_count>>8U) + 1); 
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if((NULL == srcbuffer) && (data_length > 0U))
    {
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    switch(dma_reqsrc){
        case TIMER_DMA_UPD:
            dma_irq.full_finish_handle = _update_dmatc_callback;
            dma_irq.half_finish_handle = NULL;
            dma_irq.error_handle = _timer_dmaerror_callback;
            /* start DMA interrupt mode transfer */
            hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_UP], (uint32_t)srcbuffer,TIMER_DMATB_ADDRESS(timer_dev->periph),data_length, &dma_irq);
            timer_dma_enable(timer_dev->periph, TIMER_DMA_UPD);
            break;
        case TIMER_DMA_CH0D:
            dma_irq.full_finish_handle = _channel_compare_pwm_dmatc_callback;
            dma_irq.half_finish_handle = NULL;
            dma_irq.error_handle = _timer_dmaerror_callback;
            /* start DMA interrupt mode transfer */
            hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_CH0], (uint32_t)srcbuffer,TIMER_DMATB_ADDRESS(timer_dev->periph),data_length, &dma_irq);
            timer_dma_enable(timer_dev->periph, TIMER_DMA_CH0D);
            break;
        case TIMER_DMA_CH1D:
            dma_irq.full_finish_handle = _channel_compare_pwm_dmatc_callback;
            dma_irq.half_finish_handle = NULL;
            dma_irq.error_handle = _timer_dmaerror_callback;
            /* start DMA interrupt mode transfer */
            hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_CH1], (uint32_t)srcbuffer,TIMER_DMATB_ADDRESS(timer_dev->periph),data_length, &dma_irq);
            timer_dma_enable(timer_dev->periph, TIMER_DMA_CH1D);
            break;
        case TIMER_DMA_CH2D:
            dma_irq.full_finish_handle = _channel_compare_pwm_dmatc_callback;
            dma_irq.half_finish_handle = NULL;
            dma_irq.error_handle = _timer_dmaerror_callback;
            /* start DMA interrupt mode transfer */
            hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_CH2], (uint32_t)srcbuffer,TIMER_DMATB_ADDRESS(timer_dev->periph),data_length, &dma_irq);
            timer_dma_enable(timer_dev->periph, TIMER_DMA_CH2D);
            break;
        case TIMER_DMA_CH3D:
            dma_irq.full_finish_handle = _channel_compare_pwm_dmatc_callback;
            dma_irq.half_finish_handle = NULL;
            dma_irq.error_handle = _timer_dmaerror_callback;
            /* start DMA interrupt mode transfer */
            hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_CH3], (uint32_t)srcbuffer,TIMER_DMATB_ADDRESS(timer_dev->periph),data_length, &dma_irq);
            timer_dma_enable(timer_dev->periph, TIMER_DMA_CH3D);
            break;
        case TIMER_DMA_CMTD:
            dma_irq.full_finish_handle = _commutation_dmatc_callback;
            dma_irq.half_finish_handle = NULL;
            dma_irq.error_handle = _timer_dmaerror_callback;
            /* start DMA interrupt mode transfer */
            hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_CMT], (uint32_t)srcbuffer,TIMER_DMATB_ADDRESS(timer_dev->periph),data_length, &dma_irq);
            timer_dma_enable(timer_dev->periph, TIMER_DMA_CMTD);
            break;
        case TIMER_DMA_TRGD:
            dma_irq.full_finish_handle = _trigger_dmatc_callback;
            dma_irq.half_finish_handle = NULL;
            dma_irq.error_handle = _timer_dmaerror_callback;
            /* start DMA interrupt mode transfer */
            hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_TRG], (uint32_t)srcbuffer,TIMER_DMATB_ADDRESS(timer_dev->periph),data_length, &dma_irq);
            timer_dma_enable(timer_dev->periph, TIMER_DMA_TRGD);
            break;
        default:
            HAL_DEBUGW("parameter [dma_reqsrc] value is undefine");
            break;
    }
    /* configure the TIMER DMA transfer */
    timer_dma_transfer_config(timer_dev->periph, dma_startaddr,dma_count);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER DMA mode for writing data to TIMER
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  dma_reqsrc: 
                    the argument could be selected from enumeration <hal_timer_dma_request_source_enum>
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_stop_dmatransfer_write(hal_timer_dev_struct *timer_dev, hal_timer_dma_request_source_enum dma_reqsrc)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* DMA config for request */
    switch(dma_reqsrc){
        case TIMER_DMA_UPD:
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_UP]);
            timer_dma_disable(timer_dev->periph, TIMER_DMA_UPD);
            break;
        case TIMER_DMA_CH0D:
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH0]);
            timer_dma_disable(timer_dev->periph, TIMER_DMA_CH0D);
            break;
        case TIMER_DMA_CH1D:
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH1]);
            timer_dma_disable(timer_dev->periph, TIMER_DMA_CH1D);
            break;
        case TIMER_DMA_CH2D:
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH2]);
            timer_dma_disable(timer_dev->periph, TIMER_DMA_CH2D);
            break;
        case TIMER_DMA_CH3D:
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH3]);
            timer_dma_disable(timer_dev->periph, TIMER_DMA_CH3D);
            break;
        case TIMER_DMA_CMTD:
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CMT]);
            timer_dma_disable(timer_dev->periph, TIMER_DMA_CMTD);
            break;
        case TIMER_DMA_TRGD:
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_TRG]);
            timer_dma_disable(timer_dev->periph, TIMER_DMA_TRGD);
            break;
        default:
            HAL_DEBUGW("parameter [dma_reqsrc] value is undefine");
            break;
    }
    
