SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_timer.c
    switch(dma_reqsrc){
        case TIMER_DMA_UPD:
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_UP]);
            timer_dma_disable(timer_dev->periph, TIMER_DMA_UPD);
            break;
        case TIMER_DMA_CH0D:
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH0]);
            timer_dma_disable(timer_dev->periph, TIMER_DMA_CH0D);
            break;
        case TIMER_DMA_CH1D:
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH1]);
            timer_dma_disable(timer_dev->periph, TIMER_DMA_CH1D);
            break;
        case TIMER_DMA_CH2D:
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH2]);
            timer_dma_disable(timer_dev->periph, TIMER_DMA_CH2D);
            break;
        case TIMER_DMA_CH3D:
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH3]);
            timer_dma_disable(timer_dev->periph, TIMER_DMA_CH3D);
            break;
        case TIMER_DMA_CMTD:
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CMT]);
            timer_dma_disable(timer_dev->periph, TIMER_DMA_CMTD);
            break;
        case TIMER_DMA_TRGD:
            /* stop DMA transfer */
            hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_TRG]);
            timer_dma_disable(timer_dev->periph, TIMER_DMA_TRGD);
            break;
        default:
            HAL_DEBUGW("parameter [dma_reqsrc] value is undefine");
            break;
    }
    
    return HAL_ERR_NONE;
}

/*!
    \brief      initialize TIMER HALL mode
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  hall_init: 
                  cmt_delay; 0x0-0xFFFF
                  hall_polarity: TIMER_IC_POLARITY_RISING,TIMER_IC_POLARITY_FALLING,TIMER_IC_POLARITY_BOTH_EDGE
                  hall_prescaler: TIMER_IC_PSC_DIV1,TIMER_IC_PSC_DIV2,TIMER_IC_PSC_DIV4,TIMER_IC_PSC_DIV8
                  hall_filter: 0~15
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_hall_init(hal_timer_dev_struct *timer_dev,hal_timer_hall_struct *hall_init)
{
    hal_timer_outputcompare_struct hall_oc1;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(NULL == hall_init){
        HAL_DEBUGE("pointer [hall_init] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* reset the CH0EN bit */
    TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);

    /* reset the CH0P and CH0NP bits */
    TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_CH0NP));
    TIMER_CHCTL2(timer_dev->periph) |= (uint32_t)(hall_init->hall_polarity);
    /* reset the CH0MS bit */
    TIMER_CHCTL0(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL0_CH0MS);
    TIMER_CHCTL0(timer_dev->periph) |= (uint32_t)(TIMER_IC_SELECTION_ITS);
    /* reset the CH0CAPFLT bit */
    TIMER_CHCTL0(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
    TIMER_CHCTL0(timer_dev->periph) |= (uint32_t)((uint32_t)(hall_init->hall_filter) << 4U);
    /* configure TIMER channel input capture prescaler value */
    timer_channel_input_capture_prescaler_config(timer_dev->periph, TIMER_CH_0, (uint16_t)(hall_init->hall_prescaler));
    
    /* configure TIMER hall sensor mode*/
    timer_hall_mode_config(timer_dev->periph, TIMER_HALLINTERFACE_ENABLE);
    /* select TIMER input trigger source */
    timer_input_trigger_source_select(timer_dev->periph,TIMER_SMCFG_TRGSEL_CI0F_ED);
    
    /* select TIMER slave mode */
    timer_slave_mode_select(timer_dev->periph,TIMER_SLAVE_MODE_RESTART);

    /* TIMER output compare mode struct config */
    hall_oc1.output_pulse = hall_init->cmt_delay;
    hall_oc1.output_mode = TIMER_OUTPUT_PWM1_MODE;
    hall_oc1.output_fastmode = TIMER_OC_FAST_DISABLE;
    hall_oc1.output_idlestate = TIMER_OC_IDLE_STATE_LOW;
    hall_oc1.outputn_idlestate = TIMER_OC_IDLE_STATE_LOW;
    hall_oc1.outputn_polarity = TIMER_OC_POLARITY_HIGH;
    hall_oc1.output_polarity = TIMER_OC_POLARITY_HIGH;
    /* initialize TIMER output compare mode */
    hal_timer_outputcompare_init(timer_dev,TIMER_CH_1,&hall_oc1);
    
    /* select TIMER master mode output trigger source */
    timer_master_output_trigger_source_select(timer_dev->periph, TIMER_TRI_OUT_SRC_O1CPRE);

    return HAL_ERR_NONE;
}

/*!
    \brief      start TIMER HALL mode
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_start_hall(hal_timer_dev_struct *timer_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* configure TIMER channel enable state */
    timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
    /* enable a TIMER */
    timer_enable(timer_dev->periph);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER HALL mode
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_stop_hall(hal_timer_dev_struct *timer_dev)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* configure TIMER channel enable state */
    timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER HALL mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_start_hall_interrupt(hal_timer_dev_struct *timer_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* enable the TIMER interrupt */
    timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH0);
    /* configure TIMER channel enable state */
    timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
    /* enable a TIMER */
    timer_enable(timer_dev->periph);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER HALL mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_stop_hall_interrupt(hal_timer_dev_struct *timer_dev)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* disable the TIMER interrupt */
    timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH0);
    /* configure TIMER channel enable state */
    timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER HALL mode and channel dma request
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  buffer: the source memory buffer address
    \param[in]  blength: the number of data to be transferred from source to destination
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_start_hall_dma(hal_timer_dev_struct *timer_dev, uint32_t *buffer, uint16_t blength)
{
    hal_dma_irq_struct dma_irq;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

