SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_timer.c
    dma_irq.full_finish_handle = _channel_capture_dmatc_callback;
    dma_irq.error_handle = _timer_dmaerror_callback;
    dma_irq.half_finish_handle = NULL;
    /* start DMA interrupt mode transfer */
    hal_dma_start_interrupt(timer_dev->hdma[TIM_DMA_ID_CH0], TIMER_CH0CV_ADDRESS(timer_dev->periph), (uint32_t)buffer, blength, &dma_irq);
    timer_dma_enable(timer_dev->periph, TIMER_DMA_CH0D);
    /* configure TIMER channel enable state */
    timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
    /* enable a TIMER */
    timer_enable(timer_dev->periph);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER HALL mode and channel dma request
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_stop_hall_dma(hal_timer_dev_struct *timer_dev)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    timer_dma_disable(timer_dev->periph, TIMER_DMA_CH0D);
    /* configure TIMER channel enable state */
    timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
    /* stop DMA transfer */
    hal_dma_stop(timer_dev->hdma[TIM_DMA_ID_CH0]);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    return ret_val;
}

/*!
    \brief      config TIMER commutation_event
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  trigger_source:
       \arg        TIMER_TRIGGER_SOURCE_ITI0: trigger input source selection:ITI0 
       \arg        TIMER_TRIGGER_SOURCE_ITI1: trigger input source selection:ITI1 
       \arg        TIMER_TRIGGER_SOURCE_ITI2: trigger input source selection:ITI2 
       \arg        TIMER_TRIGGER_SOURCE_ITI3: trigger input source selection:ITI3 
       \arg        TIMER_TRIGGER_SOURCE_DISABLE: trigger input source selection:none 
    \param[in]  com_source:
                only one parameter can be selected which is shown as below:
       \arg        TIMER_UPDATECTL_CCU: the shadow registers are updated when CMTG bit is set
       \arg        TIMER_UPDATECTL_CCUTRI: the shadow registers are updated when CMTG bit is set or an rising edge of TRGI occurs 
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_commutation_event_config(hal_timer_dev_struct *timer_dev,uint32_t trigger_source, uint32_t com_source)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* trigger source config */
    if((TIMER_TRIGGER_SOURCE_ITI0 == trigger_source) || (TIMER_TRIGGER_SOURCE_ITI1 == trigger_source)
        || (TIMER_TRIGGER_SOURCE_ITI2 == trigger_source) || (TIMER_TRIGGER_SOURCE_ITI3 == trigger_source)){
        TIMER_SMCFG(timer_dev->periph) &= ~TIMER_SMCFG_TRGS;
        TIMER_SMCFG(timer_dev->periph) |= trigger_source;
    }
    /* enable channel capture/compare control shadow register */
    timer_channel_control_shadow_config(timer_dev->periph, ENABLE);
    /* configure TIMER channel control shadow register update control */
    timer_channel_control_shadow_update_config(timer_dev->periph, com_source);
    return HAL_ERR_NONE;
}

/*!
    \brief      config TIMER commutation_event and enable CMT interrupt
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  trigger_source:
       \arg        TIMER_TRIGGER_SOURCE_ITI0: trigger input source selection:ITI0 
       \arg        TIMER_TRIGGER_SOURCE_ITI1: trigger input source selection:ITI1 
       \arg        TIMER_TRIGGER_SOURCE_ITI2: trigger input source selection:ITI2 
       \arg        TIMER_TRIGGER_SOURCE_ITI3: trigger input source selection:ITI3 
       \arg        TIMER_TRIGGER_SOURCE_DISABLE: trigger input source selection:none 
    \param[in]  com_source:
                only one parameter can be selected which is shown as below:
       \arg        TIMER_UPDATECTL_CCU: the shadow registers are updated when CMTG bit is set
       \arg        TIMER_UPDATECTL_CCUTRI: the shadow registers are updated when CMTG bit is set or an rising edge of TRGI occurs 
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_commutation_event_interrupt_config(hal_timer_dev_struct *timer_dev,uint32_t trigger_source, uint32_t com_source)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* trigger source config */
    if((TIMER_TRIGGER_SOURCE_ITI0 == trigger_source) || (TIMER_TRIGGER_SOURCE_ITI1 == trigger_source)
        || (TIMER_TRIGGER_SOURCE_ITI2 == trigger_source) || (TIMER_TRIGGER_SOURCE_ITI3 == trigger_source)){
        TIMER_SMCFG(timer_dev->periph) &= ~TIMER_SMCFG_TRGS;
        TIMER_SMCFG(timer_dev->periph) |= trigger_source;
    }
    /* enable channel capture/compare control shadow register */
    timer_channel_control_shadow_config(timer_dev->periph, ENABLE);
    /* configure TIMER channel control shadow register update control */
    timer_channel_control_shadow_update_config(timer_dev->periph, com_source);
    
    /* enable the TIMER interrupt */
    timer_interrupt_enable(timer_dev->periph, TIMER_INT_CMT);
    
