SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_timer.c
    return HAL_ERR_NONE;
}

/*!
    \brief      config TIMER commutation_event and enable CMT DMA request
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  trigger_source:
       \arg        TIMER_TRIGGER_SOURCE_ITI0: trigger input source selection:ITI0 
       \arg        TIMER_TRIGGER_SOURCE_ITI1: trigger input source selection:ITI1 
       \arg        TIMER_TRIGGER_SOURCE_ITI2: trigger input source selection:ITI2 
       \arg        TIMER_TRIGGER_SOURCE_ITI3: trigger input source selection:ITI3 
       \arg        TIMER_TRIGGER_SOURCE_DISABLE: trigger input source selection:none 
    \param[in]  com_source:
                only one parameter can be selected which is shown as below:
       \arg        TIMER_UPDATECTL_CCU: the shadow registers are updated when CMTG bit is set
       \arg        TIMER_UPDATECTL_CCUTRI: the shadow registers are updated when CMTG bit is set or an rising edge of TRGI occurs 
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_commutation_event_dma_config(hal_timer_dev_struct *timer_dev,uint32_t trigger_source, uint32_t com_source)
{
    hal_dma_irq_struct dma_irq;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* trigger source config */
    if((TIMER_TRIGGER_SOURCE_ITI0 == trigger_source) || (TIMER_TRIGGER_SOURCE_ITI1 == trigger_source)
        || (TIMER_TRIGGER_SOURCE_ITI2 == trigger_source) || (TIMER_TRIGGER_SOURCE_ITI3 == trigger_source)){
        TIMER_SMCFG(timer_dev->periph) &= ~TIMER_SMCFG_TRGS;
        TIMER_SMCFG(timer_dev->periph) |= trigger_source;
    }
    /* enable channel capture/compare control shadow register */
    timer_channel_control_shadow_config(timer_dev->periph, ENABLE);
    /* configure TIMER channel control shadow register update control */
    timer_channel_control_shadow_update_config(timer_dev->periph, com_source);
    
    /* DMA config for CMT dma request */
    dma_irq.full_finish_handle = _commutation_dmatc_callback;
    dma_irq.half_finish_handle = NULL;
    dma_irq.error_handle = _timer_dmaerror_callback;
    (timer_dev->hdma[TIM_DMA_ID_CMT])->dma_irq = dma_irq;
    timer_dma_enable(timer_dev->periph, TIMER_DMA_CMTD);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      set user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  user_func: point to TIMER interrupt callback functions structure
                  please refer to hal_timer_irq_struct
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_irq_handle_set(hal_timer_dev_struct *timer_dev, hal_timer_irq_struct *user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(NULL == user_func){
        HAL_DEBUGE("pointer [user_func] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    
    /* TIMER break interrupt call */
    timer_dev->timer_irq.break_usercb = (hal_irq_handle_cb)(user_func->break_usercb);
    /* channel interrupt for input capture */
    timer_dev->timer_irq.channelx_capture_usercb = (hal_irq_handle_cb)(user_func->channelx_capture_usercb);
    /* channel interrupt for compare output */
    timer_dev->timer_irq.channelx_compare_usercb = (hal_irq_handle_cb)(user_func->channelx_compare_usercb);
    /* channel interrupt for PWM output */
    timer_dev->timer_irq.channelx_pwm_usercb = (hal_irq_handle_cb)(user_func->channelx_pwm_usercb);
    /* TIMER commutation interrupt call */
    timer_dev->timer_irq.commutation_usercb = (hal_irq_handle_cb)(user_func->commutation_usercb);
    /* TIMER trigger interrupt call */
    timer_dev->timer_irq.trigger_usercb = (hal_irq_handle_cb)(user_func->trigger_usercb);
    /* TIMER update interrupt call */
    timer_dev->timer_irq.update_usercb = (hal_irq_handle_cb)(user_func->update_usercb);
    
    /* DMA channel error interrupt user callback */
    timer_dev->timer_irq.dmaerror_usercb = (hal_irq_handle_cb)(user_func->dmaerror_usercb);
    /* DMA transmission complete interrupt(TC) user callback for update dma request */
    timer_dev->timer_irq.dmatc_update_usercb = (hal_irq_handle_cb)(user_func->dmatc_update_usercb);
    /* DMA transmission complete interrupt(TC) user callback for channelx compare output and pwm output dma request */
    timer_dev->timer_irq.dmatc_chx_cmppwm_usercb = (hal_irq_handle_cb)(user_func->dmatc_chx_cmppwm_usercb);          
    /* DMA transmission complete interrupt(TC) user callback for channelx input capture dma request */
    timer_dev->timer_irq.dmatc_chx_capture_usercb = (hal_irq_handle_cb)(user_func->dmatc_chx_capture_usercb);         
    /* DMA transmission complete interrupt(TC) user callback for commutation DMA request */
    timer_dev->timer_irq.dmatc_commutation_usercb = (hal_irq_handle_cb)(user_func->dmatc_commutation_usercb);         
    /* DMA transmission complete interrupt(TC) user callback for trigger DMA request */
    timer_dev->timer_irq.dmatc_trigger_usercb = (hal_irq_handle_cb)(user_func->dmatc_trigger_usercb);             
    
    return HAL_ERR_NONE;
}

/*!
    \brief      reset all user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_irq_handle_all_reset(hal_timer_dev_struct *timer_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    
