SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_timer.c
    /* TIMER interrupt handler reset */
    timer_dev->timer_irq.break_usercb = NULL;
    timer_dev->timer_irq.channelx_capture_usercb = NULL;
    timer_dev->timer_irq.channelx_compare_usercb = NULL;
    timer_dev->timer_irq.channelx_pwm_usercb = NULL;
    timer_dev->timer_irq.commutation_usercb = NULL;
    timer_dev->timer_irq.trigger_usercb = NULL;
    timer_dev->timer_irq.update_usercb = NULL;
    timer_dev->timer_irq.dmaerror_usercb = NULL;
    timer_dev->timer_irq.dmatc_chx_capture_usercb = NULL;
    timer_dev->timer_irq.dmatc_chx_cmppwm_usercb = NULL;
    timer_dev->timer_irq.dmatc_commutation_usercb = NULL;
    timer_dev->timer_irq.dmatc_trigger_usercb = NULL;
    timer_dev->timer_irq.dmatc_update_usercb = NULL;
    
    return HAL_ERR_NONE;
}

/*!
    \brief      TIMER interrupt handler content function,which is merely used in timer_handler
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_timer_irq(hal_timer_dev_struct *timer_dev)
{
    /* check whether the update interrupt is set or not */
    if( SET == (timer_interrupt_flag_get(timer_dev->periph, TIMER_INT_FLAG_UP))){
        timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_UP);
        /* update interrupt handle */
        if(NULL != (timer_dev->timer_irq.update_usercb)){
            timer_dev->timer_irq.update_usercb(timer_dev);
        }
    }
    
    /* check whether the channel 0 capture/compare interrupt is set or not */
    if( SET == (timer_interrupt_flag_get(timer_dev->periph, TIMER_INT_FLAG_CH0))){
        timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH0);
        timer_dev->service_channel = TIMER_SERVICE_CHANNEL_0;
        /* channel 0 capture interrupt handle */
        if( 0 != (TIMER_CHCTL0(timer_dev->periph) & TIMER_CHCTL0_CH0MS) ){
            if(NULL != (timer_dev->timer_irq.channelx_capture_usercb)){
                timer_dev->timer_irq.channelx_capture_usercb(timer_dev);
            }
        }else{
            /* channel 0 compare interrupt handle */
            if(NULL != (timer_dev->timer_irq.channelx_compare_usercb)){
                timer_dev->timer_irq.channelx_compare_usercb(timer_dev);
            }
            /* channel 0 pwm interrupt handle */
            if(NULL != (timer_dev->timer_irq.channelx_pwm_usercb)){
                timer_dev->timer_irq.channelx_pwm_usercb(timer_dev);
            }
        }
        /* clear service channel */
        timer_dev->service_channel = TIMER_SERVICE_CHANNEL_NONE;
    }
    /* check whether the channel 1 capture/compare interrupt is set or not */
    if( SET == (timer_interrupt_flag_get(timer_dev->periph, TIMER_INT_FLAG_CH1))){
        timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH1);
        timer_dev->service_channel = TIMER_SERVICE_CHANNEL_1;
        /* channel 1 capture interrupt handle */
        if( 0 != (TIMER_CHCTL0(timer_dev->periph) & TIMER_CHCTL0_CH1MS) ){
            if(NULL != (timer_dev->timer_irq.channelx_capture_usercb)){
                timer_dev->timer_irq.channelx_capture_usercb(timer_dev);
            }
        }else{
            /* channel 1 compare interrupt handle */
            if(NULL != (timer_dev->timer_irq.channelx_compare_usercb)){
                timer_dev->timer_irq.channelx_compare_usercb(timer_dev);
            }
            /* channel 1 pwm interrupt handle */
            if(NULL != (timer_dev->timer_irq.channelx_pwm_usercb)){
                timer_dev->timer_irq.channelx_pwm_usercb(timer_dev);
            }
        }
        /* clear service channel */
        timer_dev->service_channel = TIMER_SERVICE_CHANNEL_NONE;
    }
    
    /* check whether the channel 2 capture/compare interrupt is set or not */
    if( SET == (timer_interrupt_flag_get(timer_dev->periph, TIMER_INT_FLAG_CH2)))
    {
        timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH2);
        timer_dev->service_channel = TIMER_SERVICE_CHANNEL_2;
        /* channel 2 capture interrupt handle */
        if( 0 != (TIMER_CHCTL1(timer_dev->periph) & TIMER_CHCTL1_CH2MS) ){
            if(NULL != (timer_dev->timer_irq.channelx_capture_usercb)){
                timer_dev->timer_irq.channelx_capture_usercb(timer_dev);
            }
        }else{
            /* channel 2 compare interrupt handle */
            if(NULL != (timer_dev->timer_irq.channelx_compare_usercb)){
                timer_dev->timer_irq.channelx_compare_usercb(timer_dev);
            }
            /* channel 2 pwm interrupt handle */
            if(NULL != (timer_dev->timer_irq.channelx_pwm_usercb)){
                timer_dev->timer_irq.channelx_pwm_usercb(timer_dev);
            }
        }
        /* clear service channel */
        timer_dev->service_channel = TIMER_SERVICE_CHANNEL_NONE;
    }
    
    /* check whether the channel 3 capture/compare interrupt is set or not */
    if( SET == (timer_interrupt_flag_get(timer_dev->periph, TIMER_INT_FLAG_CH3))){
        timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH3);
        timer_dev->service_channel = TIMER_SERVICE_CHANNEL_3;
        /* channel 3 capture interrupt handle */
        if( 0 != (TIMER_CHCTL1(timer_dev->periph) & TIMER_CHCTL1_CH3MS) ){
            if(NULL != (timer_dev->timer_irq.channelx_capture_usercb)){
                timer_dev->timer_irq.channelx_capture_usercb(timer_dev);
            }
        }else{
            /* channel 3 compare interrupt handle */
            if(NULL != (timer_dev->timer_irq.channelx_compare_usercb)){
                timer_dev->timer_irq.channelx_compare_usercb(timer_dev);
            }
            /* channel 3 pwm interrupt handle */
            if(NULL != (timer_dev->timer_irq.channelx_pwm_usercb)){
                timer_dev->timer_irq.channelx_pwm_usercb(timer_dev);
            }
        }
        /* clear service channel */
        timer_dev->service_channel = TIMER_SERVICE_CHANNEL_NONE;
    }
    /* check whether the commutation interrupt is set or not */
    if( SET == (timer_interrupt_flag_get(timer_dev->periph, TIMER_INT_FLAG_CMT))){
        timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CMT);
        /* commutation interrupt handle */
        if(NULL != (timer_dev->timer_irq.commutation_usercb)){
            timer_dev->timer_irq.commutation_usercb(timer_dev);
        }
    }
    /* check whether the trigger interrupt is set or not */
    if( SET == (timer_interrupt_flag_get(timer_dev->periph, TIMER_INT_FLAG_TRG))){
        timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_TRG);
        /* trigger interrupt handle */
        if(NULL != (timer_dev->timer_irq.trigger_usercb)){
            timer_dev->timer_irq.trigger_usercb(timer_dev);
        }
    }
    /* check whether the break interrupt is set or not */
    if( SET == (timer_interrupt_flag_get(timer_dev->periph, TIMER_INT_FLAG_BRK))){
        timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_BRK);
        /* break interrupt handle */
        if(NULL != (timer_dev->timer_irq.break_usercb)){
            timer_dev->timer_irq.break_usercb(timer_dev);
        }
    }
}

/*!
    \brief      write the current counter value, TIMERx_CNT
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  counter_value: the counter value,0~65535
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS,HAL_ERR_VAL, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_write_counter_value(hal_timer_dev_struct *timer_dev, uint32_t counter_value)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(counter_value > UINT16_T_MAX){
        HAL_DEBUGE("parameter [counter_value] value is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* configure TIMER counter register value */
    TIMER_CNT(timer_dev->periph) = (uint32_t)counter_value;
    return HAL_ERR_NONE;
}

/*!
    \brief      read the current counter value, TIMERx_CNT
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the current counter value
*/
uint32_t hal_timer_read_counter_value(hal_timer_dev_struct *timer_dev)
{
    uint32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* get TIMER counter register value */
    ret_val = TIMER_CNT(timer_dev->periph);
    return ret_val;
}

/*!
    \brief      write counter auto reload value, TIMERx_CAR
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  autoreload: counter auto reload value,0~65535
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS,HAL_ERR_VAL, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_write_autoreload_value(hal_timer_dev_struct *timer_dev, uint32_t autoreload)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(autoreload > UINT16_T_MAX){
        HAL_DEBUGE("parameter [autoreload] value is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    TIMER_CAR(timer_dev->periph) = (uint32_t)autoreload;
    return HAL_ERR_NONE;
}

/*!
    \brief      read counter auto reload value, TIMERx_CAR
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the counter auto reload value
*/
uint32_t hal_timer_read_autoreload_value(hal_timer_dev_struct *timer_dev)
{
    uint32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* get TIMER counter register value */
    ret_val = TIMER_CAR(timer_dev->periph);
    return ret_val;
}

/*!
    \brief      write counter repetition value, TIMERx_CREP
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  repetition_value: counter repetition value,0~255
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS,HAL_ERR_VAL, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_write_repetition_value(hal_timer_dev_struct *timer_dev, uint32_t repetition_value)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(repetition_value > UINT8_T_MAX){
        HAL_DEBUGE("parameter [repetition_value] value is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    TIMER_CREP(timer_dev->periph) = (uint32_t)repetition_value;
    return HAL_ERR_NONE;
}

/*!
    \brief      read counter repetition value, TIMERx_CREP
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the counter repetition value
*/
uint32_t hal_timer_read_repetition_value(hal_timer_dev_struct *timer_dev)
{
    uint32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* get TIMER counter register value */
    ret_val = TIMER_CREP(timer_dev->periph);
    return ret_val;
}

/*!
    \brief      write prescaler value of the counter clock, TIMERx_PSC
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  prescaler: prescaler value of the counter clock,0~65535
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS,HAL_ERR_VAL, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_write_prescaler_value(hal_timer_dev_struct *timer_dev, uint32_t prescaler)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(prescaler > UINT16_T_MAX){
        HAL_DEBUGE("parameter [prescaler] value is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    TIMER_PSC(timer_dev->periph) = (uint32_t)prescaler;
    return HAL_ERR_NONE;
}

/*!
    \brief      read prescaler value of the counter clock, TIMERx_PSC
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the prescaler value of the counter clock
*/
uint32_t hal_timer_read_prescaler_value(hal_timer_dev_struct *timer_dev)
{
    uint32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* get TIMER counter register value */
    ret_val = TIMER_PSC(timer_dev->periph);
    return ret_val;
}

/*!
    \brief      write channely capture/compare value, TIMERx_CHyCV
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,2))
    \param[in]  channel_value: capture or compare value of channel,0~65535
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS,HAL_ERR_VAL, details refer to gd32e23x_hal.h
*/
int32_t hal_timer_write_channelx_value(hal_timer_dev_struct *timer_dev, uint32_t channel, uint32_t channel_value)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(channel_value > UINT16_T_MAX){
        HAL_DEBUGE("parameter [channel_value] value is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

