SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_timer.c
    switch(channel){
    /* configure capture or compare value of channel 0 */
    case TIMER_CH_0:
        TIMER_CH0CV(timer_dev->periph) = (uint32_t)channel_value;
        break;
    /* configure capture or compare value of channel 1 */
    case TIMER_CH_1:
        TIMER_CH1CV(timer_dev->periph) = (uint32_t)channel_value;
        break;
    /* configure capture or compare value of channel 2 */
    case TIMER_CH_2:
        TIMER_CH2CV(timer_dev->periph) = (uint32_t)channel_value;
        break;
    /* configure capture or compare value of channel 3 */
    case TIMER_CH_3:
         TIMER_CH3CV(timer_dev->periph) = (uint32_t)channel_value;
        break;
    default:
        HAL_DEBUGE("parameter [channel] value is invalid");
        return HAL_ERR_VAL;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      read channely capture/compare value, TIMERx_CHyCV
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,2))
    \param[out] none
    \retval     capture or compare value of channel
*/
uint32_t hal_timer_read_channelx_value(hal_timer_dev_struct *timer_dev, uint32_t channel)
{
    uint32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev){
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    switch(channel){
    /* get capture or compare value of channel 0 */
    case TIMER_CH_0:
        ret_val = TIMER_CH0CV(timer_dev->periph);
        break;
    /* get capture or compare value of channel 1 */
    case TIMER_CH_1:
        ret_val = TIMER_CH1CV(timer_dev->periph);
        break;
    /* get capture or compare value of channel 2 */
    case TIMER_CH_2:
        ret_val = TIMER_CH2CV(timer_dev->periph);
        break;
    /* get capture or compare value of channel 3 */
    case TIMER_CH_3:
         ret_val = TIMER_CH3CV(timer_dev->periph);
        break;
    default:
        HAL_DEBUGE("parameter [channel] value is invalid");
        break;
    }
    return ret_val;
}

/*!
    \brief      DMA error callback TIMER all dma request
    \param[in]  dma: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _timer_dmaerror_callback(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_timer_dev_struct *p_timer;
    /* parameter assignment */
    p_dma = (hal_dma_dev_struct*)dma;
    p_timer = (hal_timer_dev_struct*)(p_dma->p_periph);
    /* call DMA error handle */
    if(NULL != (p_timer->timer_irq.dmaerror_usercb)){
        p_timer->timer_irq.dmaerror_usercb(p_timer);
    }
}

/*!
    \brief      DMA transmission complete(TC) callback for TIMER update dma request
    \param[in]  dma: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _update_dmatc_callback(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_timer_dev_struct *p_timer;
    /* parameter assignment */
    p_dma = (hal_dma_dev_struct*)dma;
    p_timer = (hal_timer_dev_struct*)(p_dma->p_periph);
    /* call DMA transmission complete(TC) handle for TIMER update dma request */
    if(NULL != (p_timer->timer_irq.dmatc_update_usercb)){
        p_timer->timer_irq.dmatc_update_usercb(p_timer);
    }
}

/*!
    \brief      DMA transmission complete(TC) callback for TIMER compare and pwm dma request
    \param[in]  dma: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _channel_compare_pwm_dmatc_callback(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_timer_dev_struct *p_timer;
    /* parameter assignment */
    p_dma = (hal_dma_dev_struct*)dma;
    p_timer = (hal_timer_dev_struct*)(p_dma->p_periph);
    /* service channel assignment */
    if (dma == p_timer->hdma[TIM_DMA_ID_CH0]){
        p_timer->service_channel = TIMER_SERVICE_CHANNEL_0;
    }else if (dma == p_timer->hdma[TIM_DMA_ID_CH1]){
        p_timer->service_channel = TIMER_SERVICE_CHANNEL_1;
    }else if (dma == p_timer->hdma[TIM_DMA_ID_CH2]){
        p_timer->service_channel = TIMER_SERVICE_CHANNEL_2;
    }else if (dma == p_timer->hdma[TIM_DMA_ID_CH3]){
        p_timer->service_channel = TIMER_SERVICE_CHANNEL_3;
    }
    /* call DMA transmission complete(TC) handle for TIMER compare and pwm dma request */
    if(NULL != (p_timer->timer_irq.dmatc_chx_cmppwm_usercb)){
        p_timer->timer_irq.dmatc_chx_cmppwm_usercb(p_timer);
    }
    /* clear service channel */
    p_timer->service_channel = TIMER_SERVICE_CHANNEL_NONE;
}

/*!
    \brief      DMA transmission complete(TC) callback for TIMER channel input capture dma request
    \param[in]  dma: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _channel_capture_dmatc_callback(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_timer_dev_struct *p_timer;
    /* parameter assignment */
    p_dma = (hal_dma_dev_struct*)dma;
    p_timer = (hal_timer_dev_struct*)(p_dma->p_periph);
    /* service channel assignment */
    if (dma == p_timer->hdma[TIM_DMA_ID_CH0]){
        p_timer->service_channel = TIMER_SERVICE_CHANNEL_0;
    }else if (dma == p_timer->hdma[TIM_DMA_ID_CH1]){
        p_timer->service_channel = TIMER_SERVICE_CHANNEL_1;
    }else if (dma == p_timer->hdma[TIM_DMA_ID_CH2]){
        p_timer->service_channel = TIMER_SERVICE_CHANNEL_2;
    }else if (dma == p_timer->hdma[TIM_DMA_ID_CH3]){
        p_timer->service_channel = TIMER_SERVICE_CHANNEL_3;
    }
    /* call DMA transmission complete(TC) handle for TIMER input capture dma request */
    if(NULL != (p_timer->timer_irq.dmatc_chx_capture_usercb)){
        p_timer->timer_irq.dmatc_chx_capture_usercb(p_timer);
    }
    p_timer->service_channel = TIMER_SERVICE_CHANNEL_NONE;
}

/*!
    \brief      DMA transmission complete(TC) callback for TIMER commutation dma request
    \param[in]  dma: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _commutation_dmatc_callback(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_timer_dev_struct *p_timer;
    /* parameter assignment */
    p_dma = (hal_dma_dev_struct*)dma;
    p_timer = (hal_timer_dev_struct*)(p_dma->p_periph);
    /* call DMA transmission complete(TC) handle for TIMER commutation dma request */
    if(NULL != (p_timer->timer_irq.dmatc_commutation_usercb)){
        p_timer->timer_irq.dmatc_commutation_usercb(p_timer);
    }
}

/*!
    \brief      DMA transmission complete(TC) callback for TIMER trigger dma request
    \param[in]  dma: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _trigger_dmatc_callback(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_timer_dev_struct *p_timer;
    /* parameter assignment */
    p_dma = (hal_dma_dev_struct*)dma;
    p_timer = (hal_timer_dev_struct*)(p_dma->p_periph);
    /* call DMA transmission complete(TC) handle for TIMER trigger dma request */
    if(NULL != (p_timer->timer_irq.dmatc_trigger_usercb)){
        p_timer->timer_irq.dmatc_trigger_usercb(p_timer);
    }
}

/*!
    \brief      disable TIMER
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NO_SUPPORT, details refer to gd32e23x_hal.h
*/
static int32_t _timer_disable(hal_timer_dev_struct *timer_dev)
{
    uint32_t chctl2;
    chctl2 = TIMER_CHCTL2(timer_dev->periph);
    /* determine whether channel is disabled */
    if( 0 == (chctl2 & TIMER_CHX_EN_MASK) ){
        if( 0 == (chctl2 & TIMER_CHNX_EN_MASK) ){
            /* complementay channel is disabled */
            timer_disable(timer_dev->periph);
            return HAL_ERR_NONE;
        }else{
            /* complementay channel is not disabled */
            return HAL_ERR_NO_SUPPORT;
        }
    }else{
        /* channel is not disabled */
        return HAL_ERR_NO_SUPPORT;
    }
}

/*!
    \brief      enable or disable TIMER primary output
    \param[in]  timer_dev: TIMER device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  state: EBANLE, DISABLE
    \param[out] none
    \retval     none
*/
static void _timer_primary_output_config(hal_timer_dev_struct *timer_dev , ControlStatus state)
{
    uint32_t chctl2;
    chctl2 = TIMER_CHCTL2(timer_dev->periph);
    /* TIMER which has primary output enable(POE) bit */
    if((TIMER0 == timer_dev->periph) || (TIMER14 == timer_dev->periph)
        || (TIMER15 == timer_dev->periph) || (TIMER16 == timer_dev->periph)){
        if(ENABLE == state){
            /* enable TIMER primary output */
            TIMER_CCHP(timer_dev->periph) |= (uint32_t)TIMER_CCHP_POEN;
        }else{
            /* disable TIMER primary output */
            if( 0 == (chctl2 & TIMER_CHX_EN_MASK) ){
                if( 0 == (chctl2 & TIMER_CHNX_EN_MASK) ){
                    TIMER_CCHP(timer_dev->periph) &= (~(uint32_t)TIMER_CCHP_POEN);
                }
            }
        }
    }
}
